[
  {
    "id": "rsi-mit",
    "title": "Research Science Initiative (RSI) at MIT",
    "details": "A 6-week intensive summer research program for high school students. The best and most prestigious HS Research EC available. Its completely free of cost and even travel stipends are available for students. So, you get to research at MIT for 6 weeks for completely FREE OF COST. Participants engage in hands-on research under the guidance of MIT faculty and researchers, focusing on topics such as chemistry, physics, computer science, and engineering. Develop advanced research skills, present findings in reports and posters, and gain mentorship in scientific methodology and experimental design.",
    "grades": [
      "11"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Summer",
    "eligibility": "RSI applicants are students with outstanding academic achievements who are entering their final year of high school. Typically, this means they apply during the middle of their junior year (grade 11). High school seniors are not eligible to apply. Each participating country has its own selection procedure and selection schedule. Please contact RSI to determine if your country participates.",
    "tips": "Emphasize your goals in STEM through your application essays. Strong standardized test scores (PSAT, SAT, ACT, AP) are recommended, but lower scores can be balanced by excellent grades, strong recommendations, and evidence of scientific or mathematical potential.",
    "whatIsLookedFor": "RSI seeks students with exceptional potential in STEM who demonstrate curiosity, self-motivation, and a passion for research. Applicants typically show strong academic achievement in math and science and take rigorous STEM courses. While prior research experience is helpful, it is not required—students can demonstrate interest through independent projects, science fairs, personal experiments, online courses, or challenging problems tackled outside school. Strong standardized test scores are recommended (PSAT Math ≥740, PSAT Evidence-Based Reading & Writing ≥700, SAT Math ≥750, ACT Math ≥33, ACT English/Verbal ≥34), but slightly lower scores can be offset by outstanding essays, recommendations, or demonstrated STEM potential. Engagement in STEM extracurriculars, leadership, and community contributions strengthens an application. Essays should clearly show curiosity, initiative, problem-solving ability, and self-directed learning. Students in areas with limited STEM opportunities are encouraged to highlight their resourcefulness and determination.",
    "format": [
      "On-site (MIT, Cambridge, MA)"
    ],
    "paid": "Free",
    "link": "https://www.cee.org/programs/apply-rsi",
    "email": "rsi@cee.org",
    "competitiveness": "High",
    "deadline": "2025-12-09T23:59:00-05:00"
  },
  {
    "id": "ssp",
    "title": "Summer Science Program (SSP)",
    "details": "A 5-week intensive residential research program on the campus of a renowned research university for rising high school seniors. Participants engage in hands-on research in topics such as Astrophysics, Biochemistry, Bacterial Genomics, Cell Biology and Synthetic Chemistry. Students work in teams, develop advanced research skills, and present their findings through reports and posters. The program emphasizes curiosity, problem-solving, and collaboration under the guidance of expert mentors.",
    "grades": [
      "11"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Summer",
    "eligibility": "Open to students currently in Class 11 (rising seniors) in India (CBSE, ISC, or equivalent). Applicants must have completed or be completing relevant STEM coursework by June for credit and a grade. For CBSE/ISC students, this includes courses in Physics, Chemistry, Mathematics, and Biology relevant to the chosen research track. Students must be between 15 and 18 years old during the program. Current Class 9, 10, or 12 students are not eligible. Advanced courses (AP/A-level) are not required, but self-study or incomplete coursework does not qualify.",
    "tips": [
      "Highlight STEM excellence: Showcase your achievements in Physics, Chemistry, Mathematics, or Biology. Even if you study in a Tier 2 or Tier 3 city, emphasize initiative through independent projects, science fairs, or problem-solving outside school.",
      "Essays matter: Clearly convey your curiosity, problem-solving skills, and passion for research. Explain why SSP aligns with your goals and how you can contribute to a collaborative research environment.",
      "Recommendations: Obtain strong letters from teachers who can attest to your academic ability and scientific curiosity.",
      "Standardized tests: Indian students do not need AP or SAT scores for admission. The only exception is international applicants needing to demonstrate English proficiency, in which case submitting a strong SAT/English score is recommended.",
      "Financial aid: Need is not a factor in admission. SSP provides financial aid covering 100% of demonstrated need, including airfare and other travel expenses. There is no application fee, ensuring accessibility for students from all regions.",
      "Use your context: Emphasize resourcefulness, self-directed learning, and initiative, especially if your school lacks advanced STEM resources. SSP values curiosity and potential as much as formal achievements."
    ],
    "whatIsLookedFor": "Students demonstrating academic excellence, curiosity, initiative, problem-solving skills, and the ability to collaborate effectively in teams. Prior research experience is helpful but not required.",
    "format": [
      "On-site, Throughout the US"
    ],
    "paid": "Almost free-Aid",
    "link": "https://ssp.org/getting-started/",
    "email": "admissions@ssp.org",
    "competitiveness": "High",
    "deadline": "2026-01-20T11:59:00-05:00"
  },
  {
    "id": "promys-india",
    "title": "PROMYS India Math Program",
    "details": "PROMYS India is a 6-week residential summer program in mathematics held at the Indian Institute of Science (IISc), Bengaluru. It offers an immersive experience in mathematical exploration for talented high school students from Standards IX to XII. Participants engage in intensive mathematical problem-solving, fostering a deep understanding of mathematical concepts and developing collaborative skills.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Camp",
    "season": "Summer",
    "format": [
      "In-person, IISC-Bengaluru"
    ],
    "paid": "Free",
    "link": "https://promys-india.org/students/programme-details-for-students/",
    "email": "info@promys-india.org",
    "eligibility": "Open to students currently in Standards IX to XII (or +1, +2, or PUC) in India. Applicants must have completed or be completing Standard IX before the start of the program. Students finishing their final year of higher secondary school or taking a gap year are eligible, provided they have not yet begun university studies. All types of schools in India—government, government-aided, private, independent, sixth form colleges, or home schools—are eligible. Applicants must be at least 15 years old and younger than 19 at the start of the program. Lectures and activities are in English, so applicants should have sufficient English proficiency to participate fully. Students already attending university are not eligible.",
    "tips": [
      "Demonstrate a strong passion for mathematics and problem-solving.",
      "All students at PROMYS India 2025 will be awarded full scholarships which covered all tuition, housing and meals for the six weeks of the programme. In addition, applicants may apply for need-based funding for travel and laundry expenses.",
      "Showcase any independent mathematical projects or achievements.",
      "Obtain letters of recommendation from teachers who can attest to your mathematical abilities and enthusiasm.",
      "Prepare for a rigorous program that emphasizes deep mathematical thinking and collaboration."
    ],
    "whatIsLookedFor": "Applicants who exhibit a deep interest in mathematics, strong problem-solving skills, and the ability to collaborate effectively in teams. PROMYS India values not only correct solutions but also creative approaches, novel methods, and original reasoning in tackling the Application Problem Set. Prior experience in mathematical competitions or independent mathematical study is advantageous but not required. The program looks for students who demonstrate curiosity, persistence, and innovative thinking in exploring mathematical problems.",
    "competitiveness": "Moderate",
    "deadline": "2026-01-15T23:59:00+05:30"
  },
  {
    "id": "promys-international",
    "title": "PROMYS International Math Program at BU",
    "details": "PROMYS is a 6-week intensive summer program in mathematics for highly motivated high school students from the U.S. and around the world at Boston University with approximately 80 high school students and 25 undergraduate counselors. Participants engage in deep mathematical exploration, solving challenging problems in number theory and related areas. The program emphasizes creativity, perseverance, and collaborative problem-solving under the mentorship of faculty and experienced counselors.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Camp",
    "season": "Summer",
    "format": [
      "In-person, Boston University, USA"
    ],
    "paid": "Almost free-Aid",
    "link": "https://promys.org/programs/promys/for-students/",
    "email": "promys@bu.edu",
    "eligibility": "Open to students in India who have completed Standard IX (or equivalent) and are at least 14 years old. Applicants must not yet be enrolled as full-time college or university students.",
    "tips": [
      "Demonstrate deep interest in mathematics and problem-solving through the solutions submission to a challenging problem set",
      "Highlight participation in math competitions, independent study, or related projects.",
      "Obtain strong letters of recommendation from teachers familiar with your mathematical abilities.",
      "Prepare for rigorous exploration of challenging problems, focusing on creative and original approaches, not just solutions, through essays.",
      "Financial aid for international students is considered on a case-by-case basis. If you are an international student who requires financial aid to attend PROMYS, we encourage you to apply and submit a financial aid form by the application deadline."
    ],
    "whatIsLookedFor": "Students with strong mathematical curiosity, problem-solving skills, and the ability to work collaboratively. PROMYS emphasizes creative approaches, original reasoning, and persistence in exploring mathematical problems rather than just arriving at solutions. Prior competition experience is helpful but not required.",
    "competitiveness": "Moderate",
    "deadline": "2026-03-01T23:59:00-05:00"
  },
  {
    "id": "sumac-stanford",
    "title": "Stanford University Mathematics Camp (SUMaC)",
    "details": "SUMaC is an intensive 3–4 week summer program for highly motivated high school students from around the world, offered both online and residential at Stanford University. Participants engage in advanced mathematical exploration through lectures, problem sets, and guided research in topics such as abstract algebra, number theory, and topology. The program emphasizes creativity, perseverance, and collaborative problem-solving, providing students with a college-level experience and exposure to current mathematical research.",
    "grades": [
      "10",
      "11"
    ],
    "category": "STEM",
    "type": "Camp",
    "season": "Summer",
    "format": [
      "Online/ In-person, Stanford University, USA"
    ],
    "paid": "Almost free-Aid",
    "link": "https://sumac.spcs.stanford.edu/",
    "email": "https://spcsportal.stanford.edu/s/",
    "eligibility": "Open to students in India who are currently in Standards X–XI (or equivalent) at the time of application. Applicants must have completed Standard IX (or equivalent) before the program starts and must not yet be enrolled as full-time college students. Students who will be 18 years or older during the program are not eligible for the residential program but may apply for the online option. Minimum age requirement is 14 years.",
    "tips": [
      "Showcase your interest and curiosity in advanced mathematics through prior coursework, problem-solving, or math competitions.",
      "Financial aid is granted based upon demonstrated financial need. Aid is open to all applicants and applying for financial aid does not have an effect on your admissions decision.",
      "Highlight independent projects or mathematical exploration outside school.",
      "Obtain strong recommendation letters from teachers who can attest to your mathematical ability and collaborative skills.",
      "Prepare for rigorous problem sets and demonstrate creativity in your approaches rather than just solutions.",
      "For international students, apply for financial aid if needed to cover program tuition and related costs."
    ],
    "whatIsLookedFor": "Students with a strong interest in mathematics, problem-solving ability, and collaborative skills. SUMaC values creative approaches, original reasoning, and persistence in tackling challenging problems, not just arriving at correct answers. Prior math competition experience is helpful but not required.",
    "competitiveness": "Moderate",
    "deadline": "2026-02-01T23:59:00-08:00"
  },
  {
    "id": "isro-yuvika",
    "title": "ISRO Young Scientist Programme (YUVIKA)",
    "details": "YUVIKA is a two-week residential program by ISRO designed to introduce younger students to Space Technology, Space Science, and Space Applications. Participants engage in lectures, hands-on activities, project work, and educational visits. The program is conducted at seven ISRO centres across India and emphasizes curiosity, problem-solving, teamwork, and an understanding of India's space missions and technologies.",
    "grades": [
      "9"
    ],
    "category": "STEM",
    "type": "Camp",
    "season": "Summer",
    "format": [
      "In-person, ISRO Centers, India"
    ],
    "paid": "Free",
    "link": "https://education.vikaspedia.in/viewcontent/education/childrens-corner/young-scientist-programme-of-isro?lgn=en",
    "email": "iyuvika@isro.gov.in",
    "eligibility": "Open to students in India who have completed Standard VIII and are currently studying in Standard IX (or equivalent). Applicants must not yet be enrolled as full-time college or university students. Minimum age requirement is 14 years.",
    "tips": [
      "Demonstrate a strong interest in space science and technology through academic projects or personal exploration.",
      "Participate in science-related extracurricular activities and highlight any relevant achievements.",
      "Obtain recommendation letters from teachers who can attest to your scientific aptitude and curiosity.",
      "Be prepared for hands-on activities, project evaluations, and quizzes during the program.",
      "Show enthusiasm and teamwork, as collaborative participation is highly valued."
    ],
    "whatIsLookedFor": "YUVIKA seeks students with strong academic performance, curiosity, and active engagement in science and extracurricular activities. Selection is based on a combination of academic marks (Class 8 or equivalent), performance in an online quiz, participation in science fairs, Olympiads, or equivalent competitions, achievements in sports, membership in Scouts, Guides, NCC, or NSS, and enrollment in rural or village schools. The program values well-rounded students who demonstrate interest, initiative, and collaborative potential in STEM and related activities.",
    "competitiveness": "Moderate",
    "deadline": "2026-03-20T23:59:00+05:30"
  },
  {
    "id": "world-science-scholars",
    "title": "World Science Scholars (WSS) Program",
    "details": "World Science Scholars (WSS) is a highly selective, free one-year program for extraordinarily gifted high school students worldwide. Participants take interactive courses led by world-renowned scientists in fields such as astrophysics, neuroscience, and computational thinking. The program includes asynchronous coursework, live sessions, and collaborative projects, giving students the opportunity to engage deeply with advanced scientific topics. Participants join a global community of 350+ students, working together on course projects under the mentorship of Nobel laureates and visionary researchers.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Camp",
    "season": "School Year",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://worldsciencescholars.com/",
    "email": "scholars@worldsciencefestival.com",
    "eligibility": "Open to students in India currently in Standards IX–XII (or equivalent) with exceptional mathematical talent. Applicants must be enrolled in high school (or an accelerated middle school program) and able to complete the one-year program before starting university. Students should demonstrate strong mathematical ability, motivation to learn beyond the school curriculum, and the capacity to discuss complex scientific and mathematical ideas in English. Applicants must have access to a computer with reliable internet and be able to commit an average of two hours per week throughout the academic year.",
    "tips": [
      "Highlight your achievements in science and mathematics, including independent projects, competitions, or research.",
      "Demonstrate curiosity and initiative in exploring advanced scientific topics.",
      "Obtain strong recommendation letters from teachers who can attest to your scientific ability and problem-solving skills.",
      "Engage thoughtfully with application materials, showing interest in the specific research topics and faculty mentorship.",
      "Financial need is not a barrier, as the program is fully free for admitted students."
    ],
    "whatIsLookedFor": "Students with exceptional scientific curiosity, strong problem-solving ability, and the capacity to collaborate in an international academic setting. Creativity, persistence, and original thinking in exploring scientific problems are highly valued.",
    "competitiveness": "High",
    "deadline": "2026-04-01T23:59:00-05:00"
  },
  {
    "id": "anveshana-prayoga",
    "title": "Anveshana Research Program by Prayoga",
    "details": "Anveshana is a 4–5 month research program designed for high school students in India, focused on hands-on scientific exploration under the mentorship of experienced researchers. Participants work on innovative projects across five thematic areas: Green Chemistry, Advanced and Functional Materials, Earth Sciences, Wellness, and Food & Agriculture. The program provides access to state-of-the-art research facilities, real-world research experience, and opportunities to publish in international peer-reviewed journals. Students develop critical thinking, problem-solving skills, and collaboration through guided research and project work.",
    "grades": [
      "8",
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Summer",
    "format": [
      "On-site, Prayoga Campus, Bengaluru, India"
    ],
    "paid": "Free",
    "link": "https://www.prayoga.org.in/anveshana",
    "email": "anveshana@prayoga.org.in",
    "eligibility": "Open to students in India currently in Standards VIII–XII (or equivalent). Applicants should have a strong interest in science and be willing to commit to a 4–5 month research project. Prior experience in science competitions or independent research is beneficial but not required.",
    "tips": [
      "Demonstrate curiosity and passion for scientific research through prior projects, experiments, or science fairs.",
      "Highlight teamwork, problem-solving skills, and perseverance in learning.",
      "Obtain recommendation letters from teachers who can attest to your scientific aptitude and initiative.",
      "Show interest in one of the five thematic research areas offered by Anveshana.",
      "Be prepared to engage deeply in research, explore unknown outcomes, and contribute creatively to the project."
    ],
    "whatIsLookedFor": "Students with strong scientific curiosity, problem-solving abilities, initiative, and collaborative skills. Anveshana values creativity, critical thinking, and persistence in conducting original research.",
    "competitiveness": "Moderate",
    "deadline": "2026-03-01T23:59:00+05:30"
  },
  {
    "id": "cern-solvay-student-camp",
    "title": "CERN-Solvay Student Research Camp",
    "details": "The CERN-Solvay student camps are week-long residential programs for high school students aged 16 and above. Students experience life at CERN, the world’s largest particle physics laboratory, conducting hands-on experiments, visiting research facilities, attending lectures with scientists, exploring scientific careers, and collaborating with peers from around the world.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Fall",
    "format": [
      "In-Person-CERN, Switzerland"
    ],
    "paid": "Free",
    "link": "https://solvay-education-programme.web.cern.ch/student-camps",
    "email": "education@cern.ch",
    "eligibility": "High school students aged 16 or older, enrolled in high school, with a digital certificate from the CERN-Solvay online physics course, and proficient in English.",
    "tips": [
      "Complete the CERN-Solvay online physics course thoroughly before applying.",
      "Demonstrate curiosity, motivation, and a clear interest in physics.",
      "Prepare a strong application including a motivation video, reference letter, and recent grade report."
    ],
    "whatIsLookedFor": "Passion for science, curiosity, motivation, teamwork, and readiness for hands-on research experiences.",
    "competitiveness": "High",
    "deadline": "2026-07-31T23:59:00+02:00"
  },
  {
    "id": "sliys-ohio-state",
    "title": "Summer Linguistic Institute for Youth Scholars (SLIYS)",
    "details": "Organized by the Ohio State University Department of Linguistics, SLIYS introduces high school students to linguistics, the scientific study of human language. Participants engage in daily live sessions covering phonetics, morphology, syntax, and language documentation. The program includes interactive fieldwork and experimental components, allowing scholars to analyze language like professional linguists.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Summer Program",
    "season": "Summer",
    "format": [
      "Online"
    ],
    "paid": "Almost free-Aid",
    "link": "https://linguistics.osu.edu/undergrad/sliys",
    "email": "linguistics@osu.edu",
    "eligibility": "High school students interested in linguistics and language study.",
    "tips": [
      "Have a curiosity about languages and how they work.",
      "Be prepared to engage actively in live sessions and exercises.",
      "Review basic concepts in phonetics, morphology, and syntax if possible before attending."
    ],
    "whatIsLookedFor": "Curiosity about languages, analytical thinking, and willingness to participate in hands-on linguistics exercises.",
    "competitiveness": "Moderate",
    "deadline": "Varies annually"
  },
  {
    "id": "yale-yygs",
    "title": "Yale Young Global Scholars (YYGS)",
    "details": "YYGS is a two-week intensive residential academic program at Yale University for highly motivated high school students from around the world. Participants immerse themselves in interdisciplinary learning, taking part in one of several thematic sessions such as Innovations in Science & Technology, Politics, Law & Economics, or Solving Global Challenges. The program emphasizes intellectual curiosity, collaborative problem-solving, and leadership skills, with lectures, seminars, and group projects led by Yale faculty and expert mentors.",
    "grades": [
      "10",
      "11"
    ],
    "category": [
      "Humanities",
      "Social Sciences",
      "STEM"
    ],
    "type": "Camp",
    "season": "Summer",
    "format": [
      "In-person, Yale University, USA"
    ],
    "paid": "Almost free-Aid",
    "link": "https://globalscholars.yale.edu/",
    "email": "https://globalscholars.yale.edu/contact-us-0",
    "eligibility": "Open to students in India currently in Standards X–XI (or equivalent) at the time of application. Applicants must have strong academic performance and demonstrate leadership potential. Students must be able to travel to the USA and obtain any required visa. The program is residential and students should be prepared for a fully immersive on-campus experience.",
    "tips": [
      "Highlight academic achievements and intellectual curiosity in your chosen thematic area.",
      "Demonstrate leadership, initiative, and teamwork experience, including extracurricular activities or projects.",
      "Obtain strong recommendation letters from teachers familiar with your academic and leadership abilities.",
      "Explain clearly in essays why you are interested in the session and how it aligns with your goals.",
      "Financial aid is available based on need; submit all required documentation on time."
    ],
    "whatIsLookedFor": "Students with strong academic abilities, curiosity, leadership potential, and collaborative skills. YYGS values initiative, creativity, and the ability to engage deeply with interdisciplinary topics.",
    "competitiveness": "High",
    "deadline": "2025-10-15T23:59:00-04:00"
  },
  {
    "id": "hmmt",
    "title": "Harvard-MIT Mathematics Tournament (HMMT)",
    "details": "HMMT is a prestigious high school mathematics competition hosted by Harvard University and MIT. Students compete individually or in teams in challenging problem-solving rounds, including algebra, geometry, combinatorics, and calculus. The tournament includes both November and February events, with opportunities for team collaboration, education sessions, and social engagement.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "In-Person"
    ],
    "paid": "Paid",
    "link": "https://www.hmmt.org/rg/info",
    "email": "registration@hmmt.org",
    "eligibility": "High school students under 21, enrolled in full-time primary or secondary education, and not belonging to more than one organization in a given season. Teams must meet geographic or school affiliation requirements.",
    "tips": [
      "Practice previous HMMT problem sets to understand difficulty and format.",
      "Develop team coordination and problem-solving strategies for timed rounds.",
      "Participate in math clubs or competitions to strengthen analytical skills."
    ],
    "whatIsLookedFor": "Strong mathematical problem-solving skills, teamwork, creativity, accuracy under timed conditions, and familiarity with advanced topics.",
    "competitiveness": "High",
    "deadline": "2026-09-21T23:59:00-04:00"
  },
  {
    "id": "microsoft-imagine-cup",
    "title": "Microsoft Imagine Cup",
    "details": "The Microsoft Imagine Cup is a global student technology competition that encourages young innovators to create applications, games, and solutions addressing real-world problems using Microsoft technologies. Participants work in teams to develop prototypes, receive mentorship, and compete for prizes and recognition on a global stage.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Competition",
    "season": "School Year",
    "format": [
      "Online",
      "In-Person"
    ],
    "paid": "Free",
    "link": "https://imaginecup.microsoft.com",
    "email": "imaginecup@microsoft.com",
    "eligibility": "Open to students globally, typically aged 16+, enrolled in high school or university. Teams can be international.",
    "tips": [
      "Focus on solving a real-world problem with a clear technological solution.",
      "Build a prototype demonstrating functionality and user experience.",
      "Prepare a compelling presentation or pitch to showcase your idea."
    ],
    "whatIsLookedFor": "Innovation, creativity, technical skill, teamwork, problem-solving, and potential societal impact.",
    "competitiveness": "High",
    "deadline": "Varies annually"
  },
  {
    "id": "insef-science-fair",
    "title": "India National Science Exhibition & Fair (INSEF)",
    "details": "INSEF is a national-level science exhibition and competition for school and college students across India. Participants present innovative science and technology projects, prototypes, and experiments. The event aims to promote scientific temper, creativity, and research skills among students, with opportunities for mentorship, awards, and recognition at the national level.",
    "grades": [
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "In-Person"
    ],
    "paid": "Free",
    "link": "https://sciencesociety.in/insef/",
    "email": "info@sciencesociety.in",
    "eligibility": "Students in grades 6–12 from schools across India. Individual and team projects accepted.",
    "tips": [
      "Develop a clear, well-documented project with innovative scientific ideas.",
      "Prepare a strong presentation and prototype to demonstrate your concept.",
      "Engage with mentors and seek feedback during project development."
    ],
    "whatIsLookedFor": "Innovation, creativity, scientific reasoning, clarity in presentation, and practical demonstration of concepts.",
    "competitiveness": "High",
    "deadline": "Varies annually (check website for updates)"
  },
  {
    "id": "mit-mathroots",
    "title": "√mathroots at MIT",
    "details": "√mathroots is a 14-day mathematical talent accelerator summer program hosted by MIT PRIMES for high-potential high school students. The program focuses on creative mathematics, problem solving, and fostering resilience, resourcefulness, and initiative in overcoming learning challenges. Students engage in rigorous math sessions and collaborative problem-solving activities.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Summer Program",
    "season": "Summer",
    "format": [
      "In-Person at MIT, Boston, USA"
    ],
    "paid": "Free",
    "link": "https://mathroots.mit.edu/",
    "email": "primes@math.mit.edu",
    "eligibility": "High-potential high school students interested in exploring creative mathematics and problem solving, encouraged to apply even if they have faced barriers to learning.",
    "tips": [
      "Demonstrate creativity and problem-solving skills in your application.",
      "Highlight resilience, resourcefulness, and initiative in overcoming learning challenges.",
      "Engage actively with peers during collaborative problem-solving sessions."
    ],
    "whatIsLookedFor": "Mathematical talent, creativity, initiative, resilience, and collaborative problem-solving ability.",
    "competitiveness": "High",
    "deadline": "2026-03-03T23:59:00-05:00"
  },
  {
    "id": "telluride-tass",
    "title": "Telluride Association Summer Seminar (TASS)",
    "details": "TASS is a free, intensive, residential summer program for high school sophomores and juniors, designed to foster critical thinking, democratic community, and intellectual growth. Participants attend college-level seminars in humanities and social sciences, engage in small-group discussions, lectures, and workshops, and write essays under the guidance of experienced faculty. The program also emphasizes community living, collaborative decision-making, transformative justice, and public speaking skills. Students gain a holistic educational experience combining academic rigor with personal and social development.",
    "grades": [
      "10",
      "11"
    ],
    "category": [
      "Humanities",
      "Social Sciences"
    ],
    "type": "Camp",
    "season": "Summer",
    "format": [
      "In-person, Telluride Houses, USA"
    ],
    "paid": "Free",
    "link": "https://tellurideassociation.org/our-programs/high-school-students/",
    "email": "https://tellurideassociation.org/about-us/contact-us/",
    "eligibility": "Open to students in India currently in Standards X–XI (or equivalent) at the time of application. Applicants must be at least 15 years old by the start of the program and no older than 17 by the end of the program. Both US and international students are welcome. Participants must be intellectually curious, self-motivated, and able to thrive in a residential community setting.",
    "tips": [
      "Demonstrate intellectual curiosity and engagement with social, historical, and cultural topics.",
      "Show leadership, teamwork, and community-mindedness in school or extracurricular activities.",
      "Obtain strong recommendation letters from teachers familiar with your academic and personal abilities.",
      "Prepare thoughtful responses in essays and application materials reflecting your interests and goals.",
      "Be ready to fully participate in residential community life and collaborative decision-making."
    ],
    "whatIsLookedFor": "Students who are intellectually curious, self-motivated, and community-minded. TASS values critical thinking, collaborative skills, leadership potential, and the ability to engage deeply with complex social and humanities topics. A willingness to actively participate in a residential community is essential.",
    "competitiveness": "High",
    "deadline": "2025-12-03T23:59:00-05:00"
  },
  {
    "id": "algoverse-ai-research",
    "title": "Algoverse AI Research Program",
    "details": "The Algoverse AI Research Program is a hands-on, intensive summer program for high school students interested in artificial intelligence, machine learning, and data science. Participants work on real-world AI projects under the mentorship of experts, exploring areas such as computer vision, natural language processing, reinforcement learning, and ethical AI. The program emphasizes practical skills, research experience, collaborative problem-solving, and the development of AI applications.",
    "grades": [
      "9",
      "10",
      "11",
      "12",
      "Undergraduate"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": [
      "Summer",
      "Fall",
      "Winter"
    ],
    "format": [
      "Online"
    ],
    "paid": "Paid",
    "link": "https://algoverseairesearch.org/ai-research-program",
    "email": "admissions@algoverse.us",
    "eligibility": "Open to students in India currently in Standards IX–XII (or equivalent) and UG students. Applicants must have a strong interest in AI and computer science, be motivated to work on research projects, and have basic programming knowledge in Python or another programming language. No prior research experience is required.",
    "tips": [
      "They offer scholarships to exceptional applicants who cannot afford the program fee.",
      "Showcase independent projects, competitions, or hackathons related to AI or STEM.",
      "Obtain recommendation letters from teachers or mentors who can attest to your technical ability and curiosity.",
      "Be prepared to demonstrate problem-solving skills and creativity in AI project submissions."
    ],
    "whatIsLookedFor": "Students with strong curiosity in AI and machine learning, problem-solving ability, and collaborative skills. Algoverse values initiative, creativity, and persistence in exploring AI concepts and developing innovative solutions.",
    "competitiveness": "Low",
    "deadline": "Varies annually"
  },
  {
    "id": "lumiere-scholars-essay-award",
    "title": "Lumiere Scholars Essay Award",
    "details": "The Lumiere Scholars Essay Award is a world-class essay competition for ambitious high school students, open globally. Participants explore issues that matter to them, cross disciplinary boundaries, test assumptions, and defend arguments with rigorous evidence. Essays are reviewed by an international panel of distinguished professors and researchers. Winners receive cash prizes and scholarships to Lumiere's Individual Research Program, fostering critical thinking, effective communication, and research skills.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "STEM",
      "Humanities",
      "Social Sciences"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.lumiere-education.com/lumiere-scholars-essay-award",
    "email": "contact@lumiere.education",
    "eligibility": "Open to high school students in India (Standards IX–XII or equivalent). Participants should have strong writing, critical thinking, and research skills. No prior experience is required, but students should be motivated to explore complex topics and present well-supported arguments.",
    "tips": [
      "Choose a prompt that resonates with your interests and allows for critical exploration.",
      "Demonstrate clarity of thought, originality, and depth of analysis in your essay.",
      "Provide evidence to support your arguments and ensure rigorous reasoning.",
      "Obtain recommendation letters from teachers familiar with your research and writing abilities, if required.",
      "Proofread carefully and follow all submission guidelines."
    ],
    "whatIsLookedFor": "Students who show intellectual curiosity, strong analytical skills, creativity in argumentation, and the ability to communicate ideas effectively. The award values originality, critical thinking, and cross-disciplinary insight.",
    "competitiveness": "Moderate",
    "deadline": "2025-11-02T11:59:00-04:00"
  },
  {
    "id": "lumiere-research-program",
    "title": "Lumiere Education Research Program",
    "details": "The Lumiere Individual Research Program is a paid, mentor-guided research opportunity for high school students globally. Participants engage in independent, in-depth research under the guidance of expert mentors from top universities. The program emphasizes critical thinking, problem-solving, and research communication. Students produce a final research report, develop presentation skills, and gain experience in academic-style research methodology.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "STEM",
      "Humanities",
      "Social Sciences"
    ],
    "type": "Research Program",
    "season": [
      "Fall",
      "Summer",
      "Winter",
      "Spring"
    ],
    "format": [
      "Online"
    ],
    "paid": "Paid",
    "link": "https://www.lumiere-education.com/programs",
    "email": "contact@lumiere.education",
    "eligibility": "Open to students in India (Standards IX–XII or equivalent) who are highly motivated to conduct independent research. Students must have strong critical thinking and writing skills. Prior research experience is beneficial but not required.",
    "tips": [
      "Highlight your research interests and any prior independent projects.",
      "we also offer financial aid and scholarship to our scholars. ",
      "Demonstrate your ability to work independently and manage time effectively.",
      "Obtain strong recommendation letters from teachers familiar with your academic and research abilities.",
      "Prepare a clear research proposal outlining your objectives, methods, and expected outcomes.",
      "Show enthusiasm for the mentorship opportunity and readiness to engage in rigorous research."
    ],
    "whatIsLookedFor": "Students with curiosity, initiative, analytical thinking, and the ability to conduct independent research. Lumiere values originality, persistence, and clarity in communication of research ideas.",
    "competitiveness": "Moderate",
    "deadline": "Varies annually"
  },
  {
    "id": "lumiere-junior-explorer",
    "title": "Lumiere Junior Explorer Program",
    "details": "The Lumiere Junior Explorer Program is designed for middle school students who are eager to explore their academic interests and develop research and critical thinking skills. Students are paired with mentors from top universities who guide them through structured projects, helping them learn the basics of independent research, writing, and presentation. The program encourages curiosity and self-directed learning in a supportive environment.",
    "grades": [
      "6",
      "7",
      "8"
    ],
    "category": [
      "STEM",
      "Humanities",
      "Social Sciences"
    ],
    "type": "Research Program",
    "season": [
      "Winter",
      "Spring"
    ],
    "format": [
      "Online"
    ],
    "paid": "Paid",
    "link": "https://www.lumiere-education.com/junior-explorer-program",
    "email": "acontact@lumiere.education",
    "eligibility": "Open to middle school students (grades 6–8) worldwide who are interested in exploring research and academic enrichment.",
    "tips": [
      "Highlight your curiosity and eagerness to explore new fields when applying.",
      "Show genuine interest in learning rather than prior research experience.",
      "Use the mentorship to build foundational skills for future academic programs."
    ],
    "whatIsLookedFor": "The program values curiosity, openness to learning, and the willingness to engage in independent exploration and guided research.",
    "competitiveness": "Low",
    "deadline": "Varies annually"
  },
  {
    "id": "cambridge-future-scholar",
    "title": "Cambridge Future Scholars Program",
    "details": "The Cambridge Future Scholars Program is a paid, mentor-guided online research program for high school students globally. Participants engage in structured, in-depth research courses led by professors from top universities including Oxford, Cambridge, Harvard, MIT, Stanford, UPenn, Cornell, and Columbia. The program emphasizes critical thinking, academic writing, and research methodology. Students complete research projects, gain mentorship from PhD-level teaching assistants, and may have opportunities for publication or recognition. Financial aid is available on a case-by-case basis but the program is not fully free.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "STEM",
      "Humanities",
      "Social Sciences"
    ],
    "type": "Research Program",
    "season": [
      "Fall",
      "Spring",
      "Summer"
    ],
    "format": [
      "Online"
    ],
    "paid": "Paid",
    "link": "https://cambridge-research.org/academy/cambridge-future-scholar/",
    "email": "https://cambridge-research.org/contact/",
    "eligibility": "Open to students in India (Standards IX–XII or equivalent) who are motivated to engage in structured research. Students should have strong academic and analytical skills. Prior research experience is beneficial but not required.",
    "tips": [
      "Highlight your academic interests and any prior independent or school-based research projects.",
      "Scholarships available. Highly competitive pool for financial aid. Need aware policy",
      "Demonstrate critical thinking, organization, and time management skills.",
      "Obtain recommendation letters from teachers familiar with your research or academic abilities.",
      "Prepare a clear research plan outlining objectives, methodology, and expected outcomes.",
      "Show enthusiasm for the mentorship and engagement with advanced academic research."
    ],
    "whatIsLookedFor": "Students with strong curiosity, analytical skills, initiative, and the ability to conduct guided research. The program values critical thinking, originality, and clarity in research communication.",
    "competitiveness": "Moderate",
    "deadline": "Varies annually"
  },
  {
    "id": "aops-mit-primes-crowdmath",
    "title": "AoPS MIT PRIMES / CrowdMath",
    "details": "This program is an online collaborative mathematics research initiative for high school students, run by MIT PRIMES in partnership with Art of Problem Solving (AoPS). Participants work in small teams to solve open-ended research problems in areas like combinatorics, number theory, and algebra. Students gain experience with mathematical research, proof writing, and collaborative problem-solving.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Annual",
    "format": [
      "Online",
      "Project-Based",
      "Team Collaboration",
      "Mentored"
    ],
    "paid": "Free",
    "link": "https://artofproblemsolving.com/polymath/mitprimes",
    "email": "primes@math.mit.edu",
    "eligibility": "High school students with strong mathematical problem-solving skills, especially those experienced in advanced topics like combinatorics, algebra, and number theory.",
    "tips": [
      "Familiarize yourself with mathematical research papers and problem-solving techniques.",
      "Be proactive in team collaboration and communication.",
      "Develop clear proof-writing and logical reasoning skills."
    ],
    "whatIsLookedFor": "Mathematical creativity, teamwork, independent thinking, persistence, and ability to contribute to open-ended research problems.",
    "competitiveness": "Moderate",
    "deadline": "Varies annually"
  },
  {
    "id": "genius-olympiad",
    "title": "GENIUS Olympiad",
    "details": "GENIUS Olympiad is an international high school project competition focused on environmental issues. Hosted by the Rochester Institute of Technology, students compete in eight disciplines including AI, Art, Coding, Entrepreneurship, Music, Robotics, Science, Short Film, and Speech. Participants develop projects that promote sustainability, raise awareness, and propose solutions to environmental challenges.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM & Arts",
    "type": "Competition",
    "season": "Summer",
    "format": [
      "In-Person – Rochester, NY, USA"
    ],
    "paid": "Paid",
    "link": "https://geniusolympiad.org/",
    "email": "info@geniusolympiad.org",
    "eligibility": "High school students globally, individually or in teams, with a project addressing environmental issues in one of the GENIUS disciplines.",
    "tips": [
      "Clearly define an environmental problem and your proposed solution.",
      "Demonstrate creativity, research skills, and interdisciplinary thinking.",
      "Prepare your project presentation thoroughly, including visual and/or performance components depending on the discipline."
    ],
    "whatIsLookedFor": "Innovation, environmental awareness, scientific and artistic creativity, teamwork, and problem-solving skills.",
    "competitiveness": "High",
    "deadline": "2026-03-10T23:59:00-05:00"
  },
  {
    "id": "polymath-jr",
    "title": "Polymath Jr. – Collaborative Mathematical Research",
    "details": "Polymath Jr. provides undergraduate students with collaborative research opportunities in advanced mathematics. Participants work in small groups on research problems under the guidance of professional mathematicians, graduate students, and postdocs. The program encourages writing papers, exploring new mathematical ideas, and gaining mentorship experience.",
    "grades": [
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Winter",
    "format": [
      "In-Person – USA (Washington DC)"
    ],
    "paid": "Free",
    "link": "https://geometrynyc.wixsite.com/polymathreu",
    "email": "info@geometrynyc.wixsite.com",
    "eligibility": "Undergraduate students with an interest in advanced mathematics and collaborative research.",
    "tips": [
      "Be prepared to actively participate in research groups and collaborate with peers.",
      "Demonstrate curiosity and motivation to tackle complex mathematical problems.",
      "Familiarize yourself with research topics of interest to align with available projects."
    ],
    "whatIsLookedFor": "Mathematical curiosity, problem-solving skills, teamwork, and readiness for research.",
    "competitiveness": "Moderate",
    "deadline": "Varies annually"
  },
  {
    "id": "icyss-2025",
    "title": "International Conference of Young Social Scientists (ICYSS) 2025",
    "details": "ICYSS is an international conference for high school students to engage in social science research, cultural exchange, and collaboration. Participants present research projects, attend workshops, and network with peers from around the world. The conference promotes learning about different cultures, creating friendships, and fostering interest in social sciences.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "Social Sciences",
    "type": "Research Program",
    "season": "Summer",
    "format": [
      "In-Person – Serbia"
    ],
    "paid": "Paid",
    "link": "https://icysss.edu.rs/invitation-to-the-icyss-2025/",
    "email": "nikolasrz@sbb.rs, talenti10@mts.rs",
    "eligibility": "High school students globally interested in social sciences and research projects.",
    "tips": [
      "Prepare a well-researched social science project or paper.",
      "Focus on clear presentation and communication of your research findings.",
      "Be ready to engage with international peers and participate actively in workshops."
    ],
    "whatIsLookedFor": "Research initiative, analytical thinking, curiosity about social sciences, and willingness to collaborate internationally.",
    "competitiveness": "Moderate",
    "deadline": "2026-05-31T23:59:00+02:00"
  },
  {
    "id": "chegg-global-student-prize",
    "title": "Chegg.org Global Student Prize",
    "details": "The Chegg.org Global Student Prize recognizes outstanding students aged 16 and above who make a significant impact on learning, their peers, and society. Open to students worldwide, the prize highlights academic achievement, creativity, community impact, and global citizenship. The award selects a Top 50 shortlist, then Top 10 finalists, with one winner receiving $100,000.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "Global Awards",
    "type": "Award",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.chegg.org/global-student-prize-2025-applications-and-nominations",
    "email": "info@chegg.org",
    "eligibility": "Students at least 16 years old enrolled in an academic institution, training, or skills program. Part-time and online students are eligible.",
    "tips": [
      "Show measurable impact on your peers, community, or society.",
      "Highlight academic achievements and innovative projects.",
      "Demonstrate leadership, creativity, and global citizenship."
    ],
    "whatIsLookedFor": "Impact, academic excellence, innovation, leadership, and contribution to society.",
    "competitiveness": "High",
    "deadline": "2026-04-27T23:59:00-07:00"
  },
  {
    "id": "diana-award-2026",
    "title": "The Diana Award 2026",
    "details": "The Diana Award is a global honour recognising outstanding young people driving positive social change and humanitarian work. Recipients are celebrated for creating lasting impact aligned with Sustainable Development Goals such as Quality Education, Good Health & Wellbeing, Reducing Inequality, and Climate Action. The award highlights youth-led projects and initiatives across diverse communities worldwide.",
    "grades": [
      "11",
      "12"
    ],
    "category": "Global Awards",
    "type": "Award",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://diana-award.org.uk/our-programmes-and-initiatives/award-and-development/the-diana-award",
    "email": "info@diana-award.org.uk",
    "eligibility": "Young people aged 16–24 who have been leading sustained social action or humanitarian work for at least 12 months.",
    "tips": [
      "Ensure your project or initiative demonstrates sustained social impact.",
      "Highlight alignment with one or more SDGs: Education, Health, Inequality, or Climate Action.",
      "Provide clear evidence of leadership, initiative, and positive change in the community."
    ],
    "whatIsLookedFor": "Leadership, sustained social action, humanitarian impact, alignment with SDGs, and community contribution.",
    "competitiveness": "High",
    "deadline": "2025-11-30T23:59:00+00:00"
  },
  {
    "id": "john-locke-essay-prize",
    "title": "John Locke Institute Global Essay Prize",
    "details": "The John Locke Institute Global Essay Prize invites students worldwide to explore challenging questions across seven disciplines: Philosophy, Politics, Economics, History, Psychology, Theology, and Law. Essays are evaluated by senior academics from top universities, encouraging independent thought, critical analysis, and persuasive writing. A Junior Prize is also available for students under 15.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "Humanities",
    "type": "Competition",
    "season": "Summer",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.johnlockeinstitute.com/essay-competition",
    "email": "info@johnlockeinstitute.com",
    "eligibility": "Students worldwide aged 18 or younger (Junior Prize for students 14 or younger).",
    "tips": [
      "Choose one question in your subject category and write an original, well-structured essay.",
      "Ensure your essay demonstrates independent thought, depth of knowledge, and clear reasoning.",
      "Provide an academic referee's email for verification of originality."
    ],
    "whatIsLookedFor": "Independent thought, critical reasoning, depth of knowledge, persuasive writing, and originality.",
    "competitiveness": "High",
    "deadline": "2026-06-30T23:59:00+00:00"
  },
  {
    "id": "immerse-essay-competition-2026",
    "title": "Immerse Education Essay Competition 2026",
    "details": "Immerse Education’s Essay Competition offers students aged 13–18 the opportunity to engage in university-level academic writing across a wide range of subjects. Participants submit original essays online, evaluated by expert tutors from leading universities such as Oxford, Cambridge, and Ivy League institutions. Winners receive scholarships and recognition to support their academic development.",
    "grades": [
      "8",
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "Humanities",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.immerse.education/essay-competition/",
    "email": "info@immerse.education",
    "eligibility": "Students aged 13–18 globally interested in developing university-level academic writing skills.",
    "tips": [
      "Choose a topic you are passionate about and conduct thorough research.",
      "Ensure your essay demonstrates critical thinking, originality, and clear argumentation.",
      "Follow submission guidelines carefully and check for clarity, grammar, and structure."
    ],
    "whatIsLookedFor": "Academic insight, originality, structured argumentation, clarity of thought, and engagement with the subject.",
    "competitiveness": "Low",
    "deadline": "2026-03-31T23:59:00+00:00"
  },
  {
    "id": "world-learning-youth-ambassadors-2026",
    "title": "World Learning Youth Ambassadors Program 2026",
    "details": "The Youth Ambassadors Program brings together high school students and adult mentors across the Western Hemisphere to promote mutual understanding, develop leadership skills, and empower youth to make a difference in their communities. Participants engage in in-person or virtual exchanges, experiential learning, leadership trainings, civic participation, volunteering, and mentoring by community and NGO leaders.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "Global Awards",
    "type": "Exchange Program",
    "season": "Summer",
    "format": [
      "In-Person"
    ],
    "paid": "Free",
    "link": "https://www.worldlearning.org/program/youth-ambassadors-program/",
    "email": "youthambassadors@worldlearning.org",
    "eligibility": "High school students from the Western Hemisphere with interest in leadership, civic engagement, and cultural exchange.",
    "tips": [
      "Demonstrate leadership potential, community involvement, and initiative.",
      "Be ready to actively engage in both experiential learning and mentoring activities.",
      "Show cultural curiosity and willingness to collaborate with peers from diverse backgrounds."
    ],
    "whatIsLookedFor": "Leadership, civic engagement, cultural awareness, collaboration, and commitment to community service.",
    "competitiveness": "High",
    "deadline": "2026-01-31T23:59:00-05:00"
  },
  {
    "id": "hpair-harvard-conference-2026",
    "title": "HPAIR Harvard Conference 2026",
    "details": "The Harvard Conference (HCONF) by HPAIR unites global students, leaders, and professionals to discuss critical global challenges. The 34th conference theme, 'Emerging Horizons: Truth at Dawn, Hope at Dusk,' explores trust, resilience, and hope across communities. The conference features panels, workshops, keynote speeches, Executive Seminars, International Night (I-Night), and the Impact Challenge to foster cross-cultural understanding, leadership, and practical problem-solving skills.",
    "grades": [
      "Undergraduate",
      "High School Seniors"
    ],
    "category": [
      "Humanities",
      "STEM",
      "Social Sciences"
    ],
    "type": "Conference",
    "season": "Winter",
    "format": [
      "In-Person – Harvard University, USA"
    ],
    "paid": "Free",
    "link": "https://www.hpair.org/hconf",
    "email": "info@hpair.org",
    "eligibility": "High school seniors and undergraduate students globally interested in leadership, global affairs, and cross-cultural engagement.",
    "tips": [
      "Apply early to secure scholarships and early bird benefits.",
      "Highlight leadership experience, community engagement, and interest in global issues.",
      "Be prepared to actively participate in panels, workshops, and networking sessions."
    ],
    "whatIsLookedFor": "Leadership potential, critical thinking, global awareness, cross-cultural engagement, and initiative.",
    "competitiveness": "High",
    "deadline": "2025-10-20T23:59:00-04:00 (Scholarship & Early Bird); 2025-11-21T23:59:00-05:00 (Regular)"
  },
  {
    "id": "planet-forward-storyfest-2026",
    "title": "Planet Forward Storyfest 2026",
    "details": "Planet Forward Storyfest is a student storytelling competition highlighting innovative solutions for environmental challenges. Students create written, video, or multimedia stories that inspire, inform, and motivate action on topics like climate justice, energy, food, water, biodiversity, public health, and the built environment. Selected stories receive recognition and winners may attend the Planet Forward Summit.",
    "grades": [
      "High School",
      "Undergraduate"
    ],
    "category": "Environmental / Media",
    "type": "Storytelling Competition",
    "season": "Winter/Spring",
    "format": [
      "Online Submission"
    ],
    "paid": "Free",
    "link": "https://planetforward.org/storyfest/",
    "email": "info@planetforward.org",
    "eligibility": "Students globally, across all academic backgrounds, interested in environmental storytelling.",
    "tips": [
      "Focus on originality, clarity, and impact of your story.",
      "Use high-quality visuals or multimedia where applicable.",
      "Align your story with one or more environmental or climate-related topics."
    ],
    "whatIsLookedFor": "Creativity, originality, technical execution, clarity of message, environmental relevance, and storytelling impact.",
    "competitiveness": "High",
    "deadline": "2026-02-09T23:59:00-05:00"
  },
  {
    "id": "bu-rise-internship-practicum",
    "title": "RISE Summer Research Program",
    "details": "The Research in Science & Engineering (RISE) program at Boston University is a six-week summer program for high school juniors, offering hands-on laboratory research and computational projects. Students work alongside faculty, postdocs, and graduate students in areas like biology, chemistry, physics, computer science, neuroscience, biomedical engineering, and public health. The program includes workshops, company visits, and a Poster Symposium showcasing student research.",
    "grades": [
      "11"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Summer",
    "format": [
      "In-Person"
    ],
    "paid": "Almost free-Aid",
    "link": "https://www.bu.edu/summer/high-school-programs/rise-internship-practicum/",
    "email": "summerhs@bu.edu",
    "eligibility": "High school juniors (domestic students) passionate about science and research. Committed to full six-week program.",
    "tips": [
      "Prepare a strong statement of interest highlighting prior experience in STEM and research.",
      "Be ready to work independently and collaboratively in a lab setting.",
      "Show curiosity, initiative, and willingness to engage in computational or experimental research."
    ],
    "whatIsLookedFor": "Research aptitude, curiosity, motivation, teamwork, technical skills, and commitment to full-time scientific research.",
    "competitiveness": "Moderate",
    "deadline": "2026-12-15T23:59:00-05:00"
  },
  {
    "id": "belinblank-sstp",
    "title": "Secondary Student Training Program (SSTP)",
    "details": "SSTP is a highly selective and intensive summer research program for advanced high school students (grades 10–11). Participants conduct original research under mentorship from University of Iowa faculty, attend academic workshops, enhance their scholarly skills, and engage in seminars and collaborative activities. The program provides college credit and fosters meaningful connections with intellectual peers.",
    "grades": [
      "10",
      "11"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Summer",
    "format": [
      "In-Person"
    ],
    "paid": "Almost free-Aid",
    "link": "https://belinblank.education.uiowa.edu/students/sstp/",
    "email": "summer@belinblank.org",
    "eligibility": "High school students in grades 10–11 with strong academic performance and research interest. International students may apply with proof of English proficiency.",
    "tips": [
      "Prepare strong essays highlighting research interests and career aspirations.",
      "Provide clear academic and character references.",
      "Demonstrate motivation, curiosity, and readiness for a full-time research experience."
    ],
    "whatIsLookedFor": "Research aptitude, intellectual curiosity, motivation, academic excellence, and alignment with faculty research interests.",
    "competitiveness": "Moderate",
    "deadline": "2026-02-16T23:59:00-06:00"
  },
  {
    "id": "inspirit-ai-scholars",
    "title": "Inspirit AI Scholars Program",
    "details": "The Inspirit AI Scholars Program is a mentor-guided online program for high school students worldwide, developed and taught by Stanford and MIT alumni and graduate students. Participants work on socially impactful AI projects in small groups, exploring areas such as generative AI, precision medicine, exoplanet detection, AI for education, and ethical AI applications. The program emphasizes hands-on learning, collaboration, problem-solving, and preparation for future AI careers and college applications.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "STEM",
      "Computer Science",
      "AI"
    ],
    "type": "Research Program",
    "season": [
      "Summer",
      "Spring"
    ],
    "format": [
      "Online"
    ],
    "paid": "Paid",
    "link": "https://www.inspiritai.com/",
    "email": "admissions@inspiritai.com",
    "eligibility": "Open to students in India currently in Standards IX–XII (or equivalent). No prior programming background is required, but interest in AI and problem-solving is recommended. Advanced cohorts are available for students with prior programming experience. Participants should have access to a computer with stable internet.",
    "tips": [
      "Demonstrate interest in AI, computer science, or related fields.",
      "students can request financial aid applications when applying to the program. They have limited financial assistance on a need basis.",
      "Highlight any prior projects, competitions, or independent study in STEM or AI.",
      "Obtain recommendation letters from teachers familiar with your technical and problem-solving abilities.",
      "Show enthusiasm for socially impactful projects and mentorship."
    ],
    "whatIsLookedFor": "Students with curiosity, problem-solving ability, and motivation to explore AI and technology for social impact. Inspirit values collaboration, creativity, persistence, and the willingness to learn from mentors and peers in a project-based environment.",
    "competitiveness": "Low",
    "deadline": "Varies annually"
  },
  {
    "id": "melton-global-solvers-accelerator-2026",
    "title": "Melton Foundation Global Solvers Accelerator 2026",
    "details": "The Global Solvers Accelerator is an 8-month peer-to-peer learning program for emerging social entrepreneurs worldwide. Participants refine and grow their social impact projects, develop leadership capacity, and collaborate with a global cohort of changemakers. The program includes virtual modules, personalized support, and a fully funded week-long in-person Co-Lab in Accra, Ghana, culminating in lifelong membership in the Melton Fellowship network.",
    "grades": [
      "12"
    ],
    "category": "Leadership / Social Impact",
    "type": "Accelerator Program",
    "season": "Annual",
    "format": [
      "Hybrid"
    ],
    "paid": "Free",
    "link": "https://meltonfoundation.org/global-solvers-accelerator/",
    "email": "info@meltonfoundation.org",
    "eligibility": "Emerging social entrepreneurs aged 20–35 with a proven track record in social impact and active leadership of a community project.",
    "tips": [
      "Highlight your social impact project and measurable outcomes.",
      "Demonstrate leadership, commitment, and curiosity to learn.",
      "Show readiness to collaborate with international peers and embrace transformative change."
    ],
    "whatIsLookedFor": "Social impact experience, leadership potential, commitment to SDGs, collaboration, and transformative thinking.",
    "competitiveness": "High",
    "deadline": "2025-12-01T23:59:00+00:00"
  },
  {
    "id": "queens-commonwealth-essay-competition-2026",
    "title": "The Queen’s Commonwealth Essay Competition 2026",
    "details": "The Queen’s Commonwealth Essay Competition, established in 1883, is the world’s oldest international writing competition for schools. It invites young people across the Commonwealth to explore topics related to journeys, culture, and personal or historical experiences. The competition develops writing skills, critical thinking, and creativity, and provides recognition for outstanding essays.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "Humanities / Writing",
    "type": "Essay Competition",
    "season": "Annual",
    "format": [
      "Online Submission"
    ],
    "paid": "Free",
    "link": "https://www.royalcwsociety.org/essay-competition",
    "email": "competitions@royalcwsociety.org",
    "eligibility": "Students across the Commonwealth, typically aged 14–18.",
    "tips": [
      "Reflect on the given theme creatively and personally.",
      "Focus on clarity, originality, and engagement in your writing.",
      "Follow the submission guidelines carefully and proofread thoroughly."
    ],
    "whatIsLookedFor": "Originality, creativity, critical thinking, clarity of expression, and relevance to the theme.",
    "competitiveness": "High",
    "deadline": "2026-06-30T23:59:00+00:00"
  },
  {
    "id": "nyt-student-online-competitions",
    "title": "New York Times Student Online Competitions",
    "details": "The New York Times Student Online Competitions provide creative opportunities for middle and high school students to engage with writing, journalism, and multimedia. Students can participate in editorials, narrative essays, educational podcasts, photo essays, and other contests. Highlights include the Student Conversation Forum on the U.S. Elections and other multimedia competitions. Winners gain recognition and may have their work published on The New York Times Learning Network.",
    "grades": [
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "Writing / Journalism / Media",
    "type": "Competition",
    "season": "Year-Round",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.nytimes.com/learning/competitions",
    "email": "learning@nytimes.com",
    "eligibility": "Current middle and high school students.",
    "tips": [
      "Follow the specific competition guidelines carefully.",
      "Focus on clarity, originality, and relevance to the theme.",
      "Engage with current events or social issues creatively and thoughtfully."
    ],
    "whatIsLookedFor": "Originality, creativity, engagement with the topic, clarity in writing or multimedia presentation, and critical thinking.",
    "competitiveness": "Moderate",
    "deadline": "Varies annually"
  },
  {
    "id": "wharton-global-youth-investment-competition-2026",
    "title": "Wharton Global Youth Investment Competition 2026",
    "details": "The Wharton Global Youth Investment Competition offers high school students a hands-on experience in investment and financial decision-making. Participants work in teams to analyze markets, manage virtual portfolios, and develop investment strategies. The program includes educational resources, case studies, and mentorship from Wharton faculty, culminating in a global showcase of student projects.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "Finance / Business / STEM",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://globalyouth.wharton.upenn.edu/competitions/investment-competition/",
    "email": "globalyouth@wharton.upenn.edu",
    "eligibility": "High school students globally, individually or in teams, interested in finance, investment, and business analytics.",
    "tips": [
      "Collaborate effectively within your team and assign roles based on strengths.",
      "Understand financial markets and research investment opportunities thoroughly.",
      "Leverage provided learning resources and case studies to inform your strategy."
    ],
    "whatIsLookedFor": "Analytical skills, teamwork, financial acumen, creativity in investment strategy, and presentation skills.",
    "competitiveness": "High",
    "deadline": "2026-03-01T23:59:00-05:00"
  },
  {
    "id": "scholastic-art-writing-awards-2026",
    "title": "Scholastic Art & Writing Awards 2026",
    "details": "The Scholastic Art & Writing Awards, organized by the Alliance for Young Artists & Writers, is the nation’s longest-running recognition program for creative teens. Students in grades 7–12 (ages 13 and up) can submit original works in 28 categories of visual and literary arts. Winners are celebrated through exhibitions, publications, and national ceremonies, and may be eligible for scholarships of up to $12,500.",
    "grades": [
      "7",
      "8",
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "Arts & Writing",
    "type": "Competition / Award",
    "season": "Annual",
    "format": [
      "Online Submission"
    ],
    "paid": "Free",
    "link": "https://www.artandwriting.org/awards/",
    "email": "info@artandwriting.org",
    "eligibility": "Students in grades 7–12 (ages 13 and up) worldwide.",
    "tips": [
      "Submit original work demonstrating creativity and technical skill.",
      "Choose a category that best fits your work for a stronger evaluation.",
      "Ensure your submission follows all guidelines and deadlines for consideration."
    ],
    "whatIsLookedFor": "Creativity, originality, technical skill, and engagement with the chosen category.",
    "competitiveness": "High",
    "deadline": "2026-01-31"
  },
  {
    "id": "sparc-summer-program",
    "title": "SPARC Summer Program",
    "details": "SPARC (Summer Program for Applied Rationality and Cognition) is a free, intensive program for talented high school students to develop advanced quantitative skills and apply them to real-world problems. The program emphasizes experiential learning through small, discussion-based classes, programming labs, self-reflection, and interactions with academics, CEOs, and philanthropists. Participants explore undergraduate and graduate-level concepts in areas like causal modeling and cognitive science, while connecting their learning to practical applications.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Summer Program",
    "season": "Summer",
    "format": [
      "In-Person"
    ],
    "paid": "Free",
    "link": "https://www.sparc.camp/",
    "email": "info@sparc.camp",
    "eligibility": "High school students with strong quantitative aptitude and interest in cognitive science, rationality, and applied mathematics.",
    "tips": [
      "Demonstrate strong quantitative and analytical skills in your application.",
      "Show motivation to apply learning to real-world problems.",
      "Be prepared for active participation, discussion, and self-reflection."
    ],
    "whatIsLookedFor": "Quantitative aptitude, curiosity, creativity, motivation, collaborative mindset, and eagerness to apply skills to practical challenges.",
    "competitiveness": "Moderate",
    "deadline": "2026-06-01T23:59:00-07:00"
  },
  {
    "id": "m3-challenge-2026",
    "title": "MathWorks Math Modeling Challenge (M³ Challenge) 2026",
    "details": "The M³ Challenge is an internet-based math modeling competition where high school teams solve real-world, open-ended problems over a 14-hour weekend. Teams of 3–5 students from the U.S., England, and Wales participate in developing solutions using mathematical modeling, analysis, and optionally MATLAB. Top teams receive scholarship awards and may travel to NYC to present their work.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Competition",
    "season": "Winter",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://m3challenge.siam.org/the-challenge/",
    "email": "m3challenge@siam.org",
    "eligibility": "High school students in the U.S., England, and Wales; teams of 3–5 students.",
    "tips": [
      "Form a balanced team with complementary skills in math, coding, and writing.",
      "Review sample problems and resources provided on the official site.",
      "Plan your 14-hour work session carefully, manage time, and divide responsibilities."
    ],
    "whatIsLookedFor": "Teamwork, mathematical modeling skills, problem-solving, clear presentation of results, and creativity.",
    "competitiveness": "High",
    "deadline": "Registration opens November 2025; exact Challenge weekend dates to be announced"
  },
  {
    "id": "nasa-space-apps-challenge-2025",
    "title": "NASA International Space Apps Challenge 2025",
    "details": "The NASA International Space Apps Challenge is a global hackathon that invites coders, scientists, designers, and storytellers to solve space-related challenges. Participants use open data provided by NASA and its Space Agency Partners to work in teams of 1–6 members to create innovative solutions. Each year focuses on a specific theme. Winning teams are recognized with invitations to a Winners Celebration at a NASA center to engage with NASA leaders and showcase their solutions.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "STEM ",
    "type": "Competition",
    "season": "Fall",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.spaceappschallenge.org/",
    "email": "spaceapps@nasaprs.com",
    "eligibility": "Open to all ages. Participants under 18 must be registered and accompanied by a parent or legal guardian.",
    "tips": [
      "Form a diverse team with complementary skills in coding, design, and research.",
      "Familiarize yourself with NASA’s open data and resources in advance.",
      "Focus on innovative, practical, and scalable solutions to the challenge theme."
    ],
    "whatIsLookedFor": "Innovation, teamwork, creativity, technical skill, and applicability of solutions to space-related challenges.",
    "competitiveness": "High",
    "deadline": "2025-06-15T23:59:00-04:00",
    "programDates": "Competition: October 5–6, 2025 | Winner Announcement: January 16, 2026"
  },
  {
    "id": "canadian-computing-competition-2026",
    "title": "Canadian Computing Competition (CCC) 2026",
    "details": "The Canadian Computing Competition (CCC) is a programming contest for secondary school students. It offers both Junior and Senior levels, challenging participants with problems that range from basic loops and conditions to IOI-level algorithms. Participants write solutions online in languages like C, C++, Python, or Java. The contest helps students develop problem-solving, algorithmic thinking, and programming skills.",
    "grades": [
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Competition",
    "season": "Winter",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://cemc.uwaterloo.ca/contests/ccc",
    "email": "cemc@uwaterloo.ca",
    "eligibility": "High school students; participants choose Junior or Senior level regardless of grade.",
    "tips": [
      "Practice using the CCC Online Grader and review past contests.",
      "Choose the level (Junior or Senior) that best matches your programming skills.",
      "Familiarize yourself with problem-solving strategies for algorithms and data structures."
    ],
    "whatIsLookedFor": "Problem-solving skills, algorithmic thinking, programming proficiency, and logical reasoning.",
    "competitiveness": "High",
    "deadline": "2026-02-12T23:59:00-05:00",
    "programDates": "North & South America: February 18, 2026 | Outside Americas: February 19, 2026"
  },
  {
    "id": "international-biology-olympiad-ibo",
    "title": "International Biology Olympiad (IBO)",
    "details": "The International Biology Olympiad (IBO) is the world’s largest biology competition for secondary school students. It takes place annually in July in different host countries and lasts one week. Participants are selected through their National Biology Olympiad (NBO) and compete in theoretical and practical biology challenges at an international level.",
    "grades": [
      "12"
    ],
    "category": "STEM",
    "type": "Competition",
    "season": "Summer",
    "format": [
      "In-Person"
    ],
    "paid": "Free",
    "link": "https://www.ibo-info.org/en/competition.html",
    "email": "office@ibo-info.org",
    "eligibility": "High school students who win their National Biology Olympiad and are selected to represent their country or region.",
    "tips": [
      "Participate and excel in your National Biology Olympiad to qualify.",
      "Develop strong theoretical knowledge and practical lab skills in biology.",
      "Practice previous IBO tasks and exams to prepare for international-level challenges."
    ],
    "whatIsLookedFor": "Strong biology knowledge, laboratory skills, problem-solving, analytical thinking, and teamwork.",
    "competitiveness": "High",
    "deadline": "Varies annually"
  },
  {
    "id": "regeneron-science-talent-search-2026",
    "title": "Regeneron Science Talent Search 2026",
    "details": "The Regeneron Science Talent Search (STS) is the nation’s oldest and most prestigious science research competition for high school students. Students submit original research projects in STEM fields for holistic review. Around 2,500 students apply annually, with the top 300 scholars, top 40 finalists, and eventual winners recognized for their scientific innovation and leadership. Finalists participate in STS Finals Week, presenting projects and attending an awards ceremony.",
    "grades": [
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online",
      "In-Person (Washington, D.C.)"
    ],
    "paid": "Free",
    "link": "https://www.societyforscience.org/regeneron-sts/",
    "email": "sts@societyforscience.org",
    "eligibility": "High school seniors in the U.S.; international students may apply through affiliated programs.",
    "tips": [
      "Submit original, well-documented research with clear societal relevance.",
      "Demonstrate scientific rigor, creativity, and innovation.",
      "Include a compelling personal statement, recommendation letters, and academic records."
    ],
    "whatIsLookedFor": "Scientific innovation, analytical skills, creativity, research impact, and leadership potential.",
    "competitiveness": "High",
    "deadline": "2025-11-06T20:00:00-05:00",
    "programDates": "Application Period: June 1 – November 6, 2025 | Top 300 Scholars: Jan 7, 2026 | Top 40 Finalists: Jan 21, 2026 | Finals Week: March 5–11, 2026 | Awards Ceremony: March 10, 2026"
  },
  {
    "id": "global-case-competition-hcgcc-2025",
    "title": "Global Case Competition (HCGCC) 2025",
    "details": "The Global Case Competition (HCGCC) is a virtual competition for ambitious high school students aged 13–18. Participants work in teams of 2–4 to tackle real-world business challenges, step into the shoes of CEOs or consultants, and present solutions to a panel of judges. The program includes on-demand bootcamps and live webinars with industry experts to develop skills in strategy, finance, design, and creativity. Top teams can win cash prizes, virtual work experiences at Fortune 500 companies, and educational consulting prizes.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "Business",
      "STEM"
    ],
    "type": "Competition",
    "season": "Fall",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.casecomp.org/",
    "email": "hello@casecomp.org",
    "eligibility": "High school students aged 13–18, enrolled in school or recently graduated, working in teams of 2–4 students.",
    "tips": [
      "Form a team with complementary skills in research, presentation, and strategy.",
      "Participate in webinars and bootcamps to strengthen your business knowledge.",
      "Start your pitchdeck early and practice the Q&A session thoroughly."
    ],
    "whatIsLookedFor": "Creativity, teamwork, strategic thinking, problem-solving, and clear presentation skills.",
    "competitiveness": "High",
    "deadline": "2025-10-15T23:59:00-05:00",
    "programDates": "Registrations: Jul 14 – Oct 15, 2025 | Regional Qualifiers: Oct 16 – Nov 7, 2025 | Global Finals: Nov 30, 2025"
  },
  {
    "id": "blue-ocean-entrepreneurship-competition-2026",
    "title": "Blue Ocean High School Entrepreneurship Competition 2026",
    "details": "The Blue Ocean High School Entrepreneurship Competition is the largest and most prestigious pitch competition for high school students worldwide. Participants, individually or in teams of up to 5, pitch innovative business ideas virtually to experienced entrepreneurs and business leaders, receive feedback, and compete for cash prizes and school awards. Students create a 5-minute video pitch according to the provided rubric and submit it online.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "Business",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://blueoceancompetition.org/",
    "email": "blueoceancompetition@gmail.com",
    "eligibility": "High school students worldwide; participants may work alone or in teams of up to 5 students.",
    "tips": [
      "Develop a clear, innovative, and practical business idea.",
      "Use the official pitch rubric from the Resources page to structure your video.",
      "Engage creatively in your presentation to impress judges and maximize impact."
    ],
    "whatIsLookedFor": "Innovation, clarity of pitch, business viability, creativity, teamwork, and presentation skills.",
    "competitiveness": "High",
    "deadline": "Varies annually (check website for updates)"
  },
  {
    "id": "nfte-impact-league-2025",
    "title": "NFTE Impact League / World Series of Innovation (WSI) 2025",
    "details": "The NFTE Impact League, part of the World Series of Innovation, is a global entrepreneurship competition for students aged 13–24. Participants, individually or in teams, tackle challenge briefs aligned with UN Sustainable Development Goals to create impactful solutions. Competitors submit innovative ideas via an online platform, receive feedback, and top entries advance to final judging with live virtual events and prizes.",
    "grades": [
      "8",
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "Business",
    "type": "Competition",
    "season": "Fall",
    "format": [
      "Online Submission; Virtual Support & Judging"
    ],
    "paid": "Free",
    "link": "https://innovation.nfte.com/impact-challenges/",
    "email": "wsi@nfte.com",
    "eligibility": "Students aged 13–24; may participate individually or in teams.",
    "tips": [
      "Select a challenge that aligns with your interests and creativity.",
      "Use the Innovators Tool Kit and rubric to structure your submission.",
      "Focus on impact, creativity, feasibility, and presentation of your solution."
    ],
    "whatIsLookedFor": "Creativity, innovation, social impact, clarity of idea, and entrepreneurial thinking.",
    "competitiveness": "High",
    "deadline": "2025-12-12T23:59:00-05:00"
  },
  {
    "id": "harvard-crimson-business-competition-2026",
    "title": "Harvard Crimson Business Competition (HCBC) 2026",
    "details": "The Harvard Crimson Business Competition is a global competition for middle and high school students to showcase their innovation and business acumen. Students work individually or in teams to develop sustainable business plans addressing global challenges, receive guidance from Harvard alumni and The Harvard Crimson, and compete in preliminary and championship rounds with top participants invited to Harvard University.",
    "grades": [
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "Business",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online",
      "In-Person- Harvard University"
    ],
    "paid": "Free",
    "link": "https://www.hcbizcomp.org/en/en/",
    "email": "info@hcbizcomp.org",
    "eligibility": "Middle and high school students worldwide; participants can compete solo or in teams (Preliminary Round: 3–8 members, Championship Round: 3–4 members).",
    "tips": [
      "Choose a global challenge that inspires you and aligns with your skills.",
      "Develop a sustainable, practical business plan with clear research and analysis.",
      "Practice presenting your ideas effectively for judges and online submission."
    ],
    "whatIsLookedFor": "Innovation, problem-solving, business acumen, creativity, teamwork, and clarity of presentation.",
    "competitiveness": "High",
    "deadline": "2026-04-15T23:59:00-05:00"
  },
  {
    "id": "harvard-crimson-global-essay-competition-2026",
    "title": "Harvard Crimson Global Essay Competition (HCGEC) 2026",
    "details": "The Harvard Crimson Global Essay Competition (HCGEC) is a fully virtual, global writing challenge for ambitious high school students. Hosted by The Harvard Crimson, it allows participants to refine writing skills, explore different writing styles, gain international recognition, and strengthen university applications. Participants attend workshops and bootcamps, compete online, and have the chance for publication and exclusive prizes.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "STEM",
      "Humanities"
    ],
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.essaycomp.org/",
    "email": "info@essaycomp.org",
    "eligibility": "High school students worldwide; participants must register online to compete.",
    "tips": [
      "Attend the provided bootcamps and webinars to strengthen your writing.",
      "Follow the competition’s guidelines for university-level essay writing.",
      "Focus on originality, clarity, and persuasive communication."
    ],
    "whatIsLookedFor": "Writing proficiency, creativity, clarity of expression, critical thinking, and engagement with the essay topic.",
    "competitiveness": "High",
    "deadline": "Varies annually"
  },
  {
    "id": "jasna-annual-essay-contest-2026",
    "title": "JASNA Annual Essay Contest 2026",
    "details": "The Jane Austen Society of North America (JASNA) conducts an annual essay contest to encourage the study and appreciation of Jane Austen’s works. Students worldwide are invited to submit essays analyzing Austen's novels, characters, motifs, or themes. Winners receive scholarships, publication opportunities, and membership in JASNA.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "Humanities",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://jasna.org/programs/essay-contest/",
    "email": "essay-contest@jasna.org",
    "eligibility": "High school, undergraduate, and graduate students worldwide. Membership in JASNA is not required.",
    "tips": [
      "Follow essay guidelines carefully and address the chosen prompt thoroughly.",
      "Use quotations from Austen’s texts to support your analysis.",
      "Ensure clarity, originality, and depth in your interpretation."
    ],
    "whatIsLookedFor": "Analytical thinking, understanding of Jane Austen’s works, originality, clarity of writing, and adherence to guidelines.",
    "competitiveness": "High",
    "deadline": "2026-02-01T23:59:00-05:00"
  },
  {
    "id": "jfk-profile-in-courage-essay-contest-2026",
    "title": "JFK Library Profile in Courage Essay Contest 2026",
    "details": "The JFK Library Profile in Courage Essay Contest invites high school students to write an original essay about an elected official who has demonstrated political courage. The contest encourages critical thinking, research, and writing skills while celebrating acts of leadership and integrity. Winners receive scholarships and the opportunity to be recognized nationally.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "Humanities",
      "Social Sciences"
    ],
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.jfklibrary.org/learn/education/profile-in-courage-essay-contest",
    "email": "education@jfklibrary.org",
    "eligibility": "High school students in the United States; students must submit original essays of 700–1,000 words.",
    "tips": [
      "Select an elected official who demonstrated true political courage.",
      "Use credible sources to support your essay with historical evidence.",
      "Ensure clarity, originality, and adherence to the word limit."
    ],
    "whatIsLookedFor": "Analytical thinking, clarity, historical accuracy, originality, and demonstration of political courage.",
    "competitiveness": "High",
    "deadline": "2026-01-09T23:59:00-05:00"
  },
  {
    "id": "engineergirl-writing-contest-2023",
    "title": "EngineerGirl Writing Contest 2023: Better Great Achievements",
    "details": "The EngineerGirl Writing Contest invites students to write about how female and/or non-white engineers have contributed to or can enhance engineering’s great achievements. Participants explore 20 major engineering accomplishments of the 20th century, reflect on diversity in engineering, and propose innovative solutions for the 21st century. Essays are evaluated on presentation of engineering, celebration of diversity, and quality of writing.",
    "grades": [
      "8",
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.engineergirl.org/148000/2023-Contest",
    "email": "engineergirl@aaes.org",
    "eligibility": "Students in grades 3–12; submissions may be individual or part of a class project.",
    "tips": [
      "Choose one of the 20 Greatest Engineering Achievements of the 20th Century as your topic.",
      "Highlight contributions from female and/or non-white engineers.",
      "Use APA citation style for references and stay within the word limits for your grade level."
    ],
    "whatIsLookedFor": "Understanding of engineering, creativity, appreciation of diversity, quality of writing, and adherence to guidelines.",
    "competitiveness": "Moderate",
    "deadline": "2026-02-01T23:59:00-05:00"
  },
  {
    "id": "ayn-rand-anthem-essay-contest-2026",
    "title": "Ayn Rand Institute Anthem Essay Contest 2026",
    "details": "The Anthem Essay Contest, hosted by the Ayn Rand Institute, invites middle and high school students worldwide to write essays on Ayn Rand’s novel 'Anthem.' Participants explore themes of individualism, freedom, and human potential. Essays are evaluated on understanding of the text, clarity, creativity, and philosophical insight. Winners receive scholarship prizes up to $25,000 and gain recognition for intellectual engagement and writing excellence.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "Humanities",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online Submission"
    ],
    "paid": "Free",
    "link": "https://aynrand.org/students/essay-contests/#tab-3-anthem",
    "email": "students@aynrand.org",
    "eligibility": "Middle and high school students worldwide, ages 13 and older; participants must be enrolled in school during the contest period.",
    "tips": [
      "Read 'Anthem' carefully and take notes on themes, characters, and key passages.",
      "Demonstrate understanding of Ayn Rand’s philosophy and its application to the essay prompt.",
      "Ensure clarity, originality, and strong reasoning in your essay."
    ],
    "whatIsLookedFor": "Comprehension of the novel, analytical thinking, creativity, philosophical insight, and quality of writing.",
    "competitiveness": "High",
    "deadline": "Varies annually"
  },
  {
    "id": "princeton-ten-minute-play-contest-2026",
    "title": "Princeton Ten-Minute Play Contest 2026",
    "details": "The Princeton Ten-Minute Play Contest is an annual playwriting competition for high school juniors (11th grade) in the U.S. and international equivalents. Students submit original plays of up to 10 pages (1 page = 1 minute). Each year, a guest playwright judges the contest. Winning plays receive cash prizes and recognition.",
    "grades": [
      "11"
    ],
    "category": "Arts",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://arts.princeton.edu/about/opportunities/high-school-contests/ten-minute-play-contest/",
    "email": "arts@princeton.edu",
    "eligibility": "Students in 11th grade in the U.S. or the international equivalent; home-schooled students at this level are also eligible.",
    "tips": [
      "Submit only one play per student or team.",
      "Keep your play under 10 pages.",
      "Focus on originality and clarity; any theme is allowed.",
      "Collaborative plays are allowed if all authors are eligible; prizes are shared."
    ],
    "whatIsLookedFor": "Creativity, originality, clarity of storytelling, and adherence to playwriting format.",
    "competitiveness": "Moderate",
    "deadline": "2026-06-01T23:59:00-05:00"
  },
  {
    "id": "princeton-milberg-poetry-prize-2026",
    "title": "Leonard L. Milberg ’53 High School Poetry Prize 2026",
    "details": "The Leonard L. Milberg ’53 High School Poetry Prize recognizes outstanding poetry by 11th grade students in the U.S. or internationally. Entries are judged by Princeton University creative writing faculty. Students can submit up to three poems, including translations of their own non-English poems. Winners receive cash prizes and recognition.",
    "grades": [
      "11"
    ],
    "category": "Arts",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://arts.princeton.edu/about/opportunities/high-school-contests/poetry-contest/",
    "email": "arts@princeton.edu",
    "eligibility": "11th grade students in the U.S. or abroad, including home-schooled students; multiple poems allowed up to three.",
    "tips": [
      "Submit your strongest original poems, up to three.",
      "If submitting poems in another language, include your own English translation.",
      "Focus on originality, clarity, and creative expression."
    ],
    "whatIsLookedFor": "Creativity, originality, quality of poetic expression, and adherence to submission guidelines.",
    "competitiveness": "Moderate",
    "deadline": "2026-04-01T23:59:00-05:00"
  },
  {
    "id": "the-blank-ypf-2026",
    "title": "The Blank Young Playwrights Festival (YPF) 2026",
    "details": "The Blank Young Playwrights Festival is an annual competition for young playwrights to have their original plays or musicals professionally mentored, directed, and performed. Participants gain feedback from professional theater artists, opportunities to develop their scripts, and experience in a real theatrical production setting.",
    "grades": [
      "11",
      "12"
    ],
    "category": "Arts",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.theblank.com/ypfsubmissions",
    "email": "YPFsubmissions@theblank.com",
    "eligibility": "Playwrights 19 years or younger as of March 15, 2026, residing or attending school in the U.S.; co-authored plays allowed if all authors meet eligibility requirements.",
    "tips": [
      "Submit original plays or musicals of any length or genre; no AI-generated content is allowed.",
      "Ensure your script has a title page and numbered pages.",
      "You may submit up to three plays, each with a separate submission form."
    ],
    "whatIsLookedFor": "Originality, creativity, theatrical potential, and quality of writing.",
    "competition": "High",
    "deadline": "2026-03-15T23:59:00-05:00"
  },
  {
    "id": "yale-daily-news-journalism-competition-2026",
    "title": "Yale Daily News Journalism Competition 2026",
    "details": "The Yale Daily News Journalism Competition is an annual contest for high school students to showcase their journalistic skills. Participants submit original reporting, feature writing, opinion pieces, or multimedia journalism projects. The competition aims to encourage student writers to develop their voice, improve journalistic techniques, and gain recognition for their work.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "Journalism",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://yaledailynews.com/symposium/competition/",
    "email": "info@yaledailynews.com",
    "eligibility": "High school students worldwide; individual submissions only.",
    "tips": [
      "Focus on originality, clarity, and journalistic integrity.",
      "Ensure proper sourcing and fact-checking in all submissions.",
      "Follow the submission guidelines and deadlines carefully."
    ],
    "whatIsLookedFor": "Accuracy, creativity, clarity, newsworthiness, and quality of writing.",
    "competitiveness": "Moderate to High",
    "deadline": "Varies annually"
  },
  {
    "id": "zero-robotics-high-school-2026",
    "title": "Zero Robotics High School Tournament 2026",
    "details": "Zero Robotics is a robotics programming competition where high school teams program Astrobee robots aboard the International Space Station (ISS). Teams first develop code online using the Zero Robotics IDE to solve annual coding challenges. Finalists get to test their programs live on the ISS, with an astronaut conducting the competition in microgravity. The tournament encourages coding, teamwork, and problem-solving in a real-world space environment.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://zerorobotics.mit.edu/what-is-zr/",
    "email": "info@zerorobotics.mit.edu",
    "eligibility": "High school students (grades 9–12) based in the United States; teams of 5–20 students with a mentor. Future expansion to international participants is planned.",
    "tips": [
      "Form a balanced team with strong programming and problem-solving skills.",
      "Familiarize yourself with the Zero Robotics IDE and past challenge games.",
      "Focus on creating autonomous programs that efficiently solve the objectives of the game."
    ],
    "whatIsLookedFor": "Coding proficiency, teamwork, strategic thinking, creativity, and ability to optimize autonomous robot programs.",
    "competitiveness": "High",
    "deadline": "Varies annually"
  },
  {
    "id": "spellman-hv-clean-tech-competition-2026",
    "title": "Spellman HV Clean Tech Competition 2026",
    "details": "The Spellman HV Clean Tech Competition is a global sustainability innovation competition for high school students. Participants, in teams of 1–3 with an adult mentor, research and propose innovative solutions to environmental challenges, such as ocean cleanup or water filtration. Submissions include a 5–15 page research paper, scored on scientific method, technological innovation, and engineering design. Top teams present virtually and compete for cash prizes.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.competitionsciences.org/competitions/spellman-hv-clean-tech-competition/",
    "email": "cleantech@cstl.org",
    "eligibility": "High school students aged 15–18; teams of 1–3 students with an adult team leader (19+).",
    "tips": [
      "Use the scientific method rigorously in your research paper.",
      "Focus on innovative, practical, and sustainable solutions.",
      "Pay attention to engineering design and identify potential challenges with solutions."
    ],
    "whatIsLookedFor": "Scientific rigor, creativity, engineering design, feasibility, and impact on sustainability.",
    "competitiveness": "High",
    "deadline": "2026-04-22T23:59:00-05:00"
  },
  {
    "id": "citizen-entrepreneurship-competition-2026",
    "title": "Citizen Entrepreneurship Competition (CEC) 2026",
    "details": "The Citizen Entrepreneurship Competition (CEC) empowers young entrepreneurs worldwide to submit innovative ideas with social impact. Participants develop projects aligned with one or more of the 17 UN Sustainable Development Goals (SDGs), complete online courses, refine their Entrepreneurial Design Canvas (EDC), and compete in three phases: idea submission, public voting, and expert jury selection. Winners are announced in an online award ceremony, and all participants gain access to a global community of like-minded innovators.",
    "grades": [
      "11",
      "12"
    ],
    "category": "Business",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://entrepreneurship.de/en/competition",
    "email": "info@entrepreneurship.de",
    "eligibility": "Entrepreneurs aged 13 and above; global participation allowed.",
    "tips": [
      "Align your idea with one or more UN Sustainable Development Goals (SDGs).",
      "Use the Entrepreneurial Design Canvas (EDC) to structure and refine your idea.",
      "Engage with the global online community for feedback and collaboration."
    ],
    "whatIsLookedFor": "Innovation, social impact, creativity, commitment to SDGs, and entrepreneurial thinking.",
    "competitiveness": "High",
    "deadline": "Check the official website for current year submission deadlines"
  },
  {
    "id": "hsarc",
    "title": "High School Academic Research Competition (SARC)",
    "details": "The High School Academic Research Competition (HSARC) is an international research competition designed to provide high school students the opportunity to showcase their academic research across disciplines. Students submit original research papers, which are evaluated by expert judges. The competition emphasizes critical thinking, originality, depth of research, and clarity of academic writing. Top submissions receive recognition, awards, and opportunities to present their work.",
    "grades": [
      "9",
      "10",
      "11",
      "12",
      "Gap Year"
    ],
    "category": [
      "STEM",
      "Humanities",
      "Social Sciences"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "Online"
    ],
    "paid": "Paid",
    "link": "https://www.researchcomp.org/",
    "email": "hello@researchcomp.org",
    "eligibility": "Open to high school students worldwide (Grades 9–12 or equivalent). Students must submit an original academic research paper in any discipline. Collaborative submissions are allowed if all contributors are in high school.",
    "tips": [
      "Select a topic that reflects your genuine interest and academic curiosity.",
      "The cost of registration is very minimal. Application fee discount codes are available.",
      "Ensure your research proposal has a clear thesis, strong evidence, and proper citations.",
      "Demonstrate originality in your research approach or argument.",
      "Follow academic writing conventions carefully, including structure and style.",
      "Revise and proofread your work thoroughly before submission."
    ],
    "whatIsLookedFor": "HSARC values originality, academic rigor, clarity of writing, and innovative approaches to research. Judges look for students who can demonstrate both depth and breadth of understanding in their chosen subject.",
    "competitiveness": "High",
    "deadline": "2026-03-08T00:00:00-05:00"
  },
  {
    "id": "ross-math-program",
    "title": "Ross Mathematics Program",
    "details": "The Ross Program is a 6-week intensive summer program for motivated pre-college students to explore mathematics deeply. Students engage in problem-solving, mathematical discovery, and collaborative learning in a supportive environment. The program nurtures mathematical curiosity, logical thinking, and critical reasoning skills, preparing students for advanced studies in mathematics, science, finance, and other analytical fields.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Summer Program",
    "season": "Summer",
    "format": [
      "In-Person"
    ],
    "paid": "Almost free-Aid",
    "link": "https://rossprogram.org/",
    "email": "ross@rossprogram.org",
    "eligibility": "Pre-college students with strong interest and aptitude in mathematics, typically entering grades 10–12.",
    "tips": [
      "Engage deeply with challenging mathematical problems.",
      "Show commitment and enthusiasm for collaborative learning.",
      "Prepare a strong application highlighting previous math experience and problem-solving skills."
    ],
    "whatIsLookedFor": "Mathematical talent, curiosity, logical reasoning, perseverance, and collaborative spirit.",
    "competitiveness": "High",
    "deadline": "2026-01-31T23:59:00-05:00 (application portal opens January 2026)"
  },
  {
    "id": "ucsc-sip",
    "title": "Science Internship Program (SIP) — UCSC",
    "details": "The Science Internship Program (SIP) at UC Santa Cruz offers high school students the chance to engage in authentic, open-ended research. The program begins with an online preparatory week and then moves into in-person research under UCSC faculty and mentors. Research areas span science, engineering, social sciences, humanities, and art. SIP encourages equity and supports need-based scholarships. :contentReference[oaicite:0]{index=0}",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Summer",
    "format": [
      "Hybrid"
    ],
    "paid": "Almost free-Aid",
    "link": "https://sip.ucsc.edu/",
    "email": "ucsc-sip@ucsc.edu",
    "eligibility": "Students must be enrolled in high school and at least 14 years old by program start. Graduated high school students are typically ineligible. :contentReference[oaicite:1]{index=1}",
    "tips": [
      "Show strong genuine interest in your research area and how you intend to learn.",
      "Emphasize ability to manage independent work and communicate with mentors.",
      "Highlight any STEM coursework, projects or self-directed learning you’ve done."
    ],
    "whatIsLookedFor": "SIP seeks students with curiosity, resilience, self-motivation, and preparedness to contribute in real research settings. Strong academic performance, commitment to science, and clear thinking in essays strengthen applications. Prior research experience helps but is not mandatory. :contentReference[oaicite:2]{index=2}",
    "competitiveness": "High",
    "deadline": "2025-03-31T23:59:00-07:00"
  },
  {
    "id": "vvm-science-contest",
    "title": "Vidyarthi Vigyan Manthan (VVM) Science Contest",
    "details": "Vidyarthi Vigyan Manthan (VVM) is India’s largest online science talent search for students of grades VI to XI, aimed at creating awareness in science, fostering excellence, and identifying students with scientific aptitude. The international edition, Śāstra Pratibhā Contest, is organized in collaboration with NCERT, NCSM, and other bodies. The contest spans multiple levels including objective tests, writing, practicals, and presentations.",
    "grades": [
      "6",
      "7",
      "8",
      "9",
      "10",
      "11"
    ],
    "category": "STEM",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://vvm.org.in/",
    "email": "info@vvm.org.in",
    "eligibility": "Students from grades VI to XI in participating countries may register. The international edition (Śāstra Pratibhā) is open to GCC countries as well.",
    "tips": [
      "Regularly practice multiple-choice science and reasoning questions.",
      "Work on speed and accuracy in solving questions under timed conditions.",
      "Read up on basic concepts in physics, chemistry, biology, and mathematics beyond the school curriculum."
    ],
    "whatIsLookedFor": "Strong aptitude for science, quick analytical thinking, consistency in performance, and clarity in writing and conceptual understanding.",
    "competitiveness": "High",
    "deadline": "2025-10-15T23:59:00+05:30"
  },
  {
    "id": "nasa-rover-challenge",
    "title": "NASA Human Exploration Rover Challenge",
    "details": "The NASA Human Exploration Rover Challenge is an annual competition for high school and college students to design, build, and race human-powered rovers simulating exploration on the Moon or Mars. Teams tackle engineering design, problem-solving, and teamwork challenges across obstacle courses replicating extraterrestrial terrain.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Competition",
    "season": "Annual",
    "format": [
      "In-Person"
    ],
    "paid": "Free",
    "link": "https://www.nasa.gov/learning-resources/nasa-human-exploration-rover-challenge/",
    "email": "stem@nasa.gov",
    "eligibility": "Open to high school and college teams internationally, typically comprising 3–6 students per team.",
    "tips": [
      "Focus on rover design optimization for weight and maneuverability.",
      "Practice teamwork and communication during rover construction and testing.",
      "Familiarize with basic mechanical engineering and materials science concepts."
    ],
    "whatIsLookedFor": "Creativity, problem-solving, engineering skill, teamwork, and performance under challenging conditions.",
    "competitiveness": "High",
    "deadline": "2025-11-15T23:59:00+05:30"
  },
  {
    "id": "lodha-genius-programme",
    "title": "Lodha Genius Programme Ashoka University",
    "details": "The Lodha Genius Programme is a fully funded, multi-year educational initiative by the Lodha Foundation in partnership with Ashoka University. Designed for exceptional students from Grade 9 through their early career, the programme offers immersive science and mathematics courses, practical life skills lessons, sustained mentorship, and exclusive access to prestigious internship opportunities. Students engage in a four-week campus experience at Ashoka University, complemented by year-round continued learning and mentorship.",
    "grades": [
      "9",
      "10",
      "11"
    ],
    "category": [
      "STEM",
      "Humanities",
      "Social Sciences"
    ],
    "type": "Research Program",
    "season": "Summer",
    "format": [
      "In-Person"
    ],
    "paid": "Free",
    "link": "https://www.lodhageniusprogramme.com/",
    "email": "lodhageniusprogramme@lodhagroup.com",
    "eligibility": "Open to students currently in Grade 9–11 across India, exhibiting academic excellence, leadership qualities, and a passion for continuous learning. The programme complements all major examination boards.",
    "tips": [
      "Demonstrate a strong aptitude in science and mathematics.",
      "Showcase leadership skills and a commitment to personal growth.",
      "Highlight any extracurricular activities or projects that reflect your passion for learning."
    ],
    "whatIsLookedFor": "The programme seeks self-motivated, ambitious students with a keen interest in science and mathematics. Applicants should exhibit problem-solving abilities, creativity, and a desire to contribute to society.",
    "competitiveness": "Moderate",
    "deadline": "2025-01-15T23:59:00+05:30"
  },
  {
    "id": "wolfram-summer-research",
    "title": "Wolfram Summer Research Program",
    "details": "A program designed for high school students to engage in research using Wolfram technologies. Students learn to apply computational thinking, data analysis, and mathematical modeling to real-world research problems, mentored by experts and guided through structured projects.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM / Computational Research",
    "type": "Research Program",
    "season": "Summer",
    "format": [
      "Online"
    ],
    "paid": "Almost free-Aid",
    "link": "https://education.wolfram.com/summer-research-high-school/",
    "email": "education@wolfram.com",
    "eligibility": "High school students worldwide, typically grades 9–12, interested in computational research and STEM.",
    "tips": [
      "Familiarize yourself with Wolfram Language and Wolfram|Alpha functionalities.",
      "Practice computational thinking and basic programming concepts.",
      "Prepare a clear research idea or area of interest before applying."
    ],
    "whatIsLookedFor": "Curiosity in computational research, problem-solving skills, motivation to learn, and ability to work on complex projects independently or in small teams.",
    "competitiveness": "Moderate",
    "deadline": "2025-04-15T23:59:00+05:30"
  },
  {
    "id": "non-trivial-research-programs",
    "title": "Non-Trivial Online Research Programs",
    "details": "Non-Trivial offers a sequence of online programs for students aged 14–20 to conduct impactful original research. Programs take students from foundational research skills to leading original projects with mentorship from experts. Stages include Research Foundations, Research Fellows, and Research Scholars, each with increasing responsibility, mentorship, and potential scholarships.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Summer",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.non-trivial.org/programs/overview",
    "email": "info@non-trivial.org",
    "eligibility": "Students aged 14–20 worldwide. Programs are designed to progress from learning research fundamentals to conducting original research.",
    "tips": [
      "Focus on generating original research ideas and refining your question.",
      "Engage actively with mentors and ask for feedback.",
      "Manage your time effectively across program stages and meet deadlines for projects."
    ],
    "whatIsLookedFor": "Curiosity, creativity, ability to conduct original research, problem-solving skills, and commitment to completing rigorous projects.",
    "competitiveness": "HModerate",
    "deadline": "2025-06-07T23:59:00+05:30"
  },
  {
    "id": "monroe-jumpstart-program",
    "title": "Monroe University JumpStart Program",
    "details": "The JumpStart Program at Monroe University allows high school juniors and seniors to take college-level courses, either on-campus or online, earning college credits that are transferable to other institutions. The program provides a head start on college education and exposure to university-level academics.",
    "grades": [
      "11",
      "12"
    ],
    "category": [
      "STEM",
      "Humanities",
      "Social Sciences"
    ],
    "type": "Summer Program",
    "season": "Summer",
    "format": [
      "In-Person",
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.monroeu.edu/admissions-and-aid/how-apply/high-school-students/jumpstart-program",
    "email": "admissions@monroeu.edu",
    "eligibility": "Open to high school juniors and seniors interested in earning college credits before graduation.",
    "tips": [
      "Choose courses aligned with your intended college major or interests.",
      "Stay disciplined with college-level coursework and time management.",
      "Engage with professors and peers to maximize learning and networking opportunities."
    ],
    "whatIsLookedFor": "Academic readiness, motivation to take college-level courses, and commitment to completing coursework successfully.",
    "competitiveness": "Low",
    "deadline": "2025-05-31T23:59:00+05:30"
  },
  {
    "id": "nyas-junior-academy",
    "title": "New York Academic of Sciences (NYAS) Junior Academy",
    "details": "The Junior Academy is a project-based learning program connecting students ages 13–17 with an online community of peers and STEM mentors. Students collaborate on real-world innovation challenges, develop critical thinking and research skills, and gain experience in STEM problem-solving through the Launchpad platform.",
    "grades": [
      "8",
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "School Year",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.nyas.org/learning/high-school-research-programs/the-junior-academy/",
    "email": "education@nyas.org",
    "eligibility": "Students aged 13–17 worldwide. Strong English proficiency required. Enthusiastic learners passionate about STEM and collaboration.",
    "tips": [
      "Engage actively with mentors and peers for guidance and collaboration.",
      "Manage your time carefully to meet challenge milestones and deadlines.",
      "Focus on developing innovative solutions and clear presentations for your projects."
    ],
    "whatIsLookedFor": "Curiosity, problem-solving skills, collaboration, creativity, and ability to work independently on research challenges.",
    "competitiveness": "Low",
    "deadline": "2026-07-08T23:59:00+05:30"
  },
  {
    "id": "uci-math-explr-2024",
    "title": "Math ExpLR Summer Research Program",
    "details": "The NSF-Simons Center for Multiscale Cell Fate Research at UC Irvine invites high school students to participate in a 6-week summer research program in computational biology. Students work in small teams with a PI on projects, attend skill-building workshops on Matlab, mathematical modeling, research presentations, and writing a research paper. Most activities are in-person, and the program is free to apply and participate.",
    "grades": [
      "9",
      "10",
      "11"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Summer",
    "format": [
      "In-Person"
    ],
    "paid": "Almost free-Aid",
    "link": "https://cellfate.uci.edu/mathbiou-math-explr-2024/",
    "email": "cellfate@uci.edu",
    "eligibility": "Current high school students (grades 9–11). Middle school students and graduating seniors are not eligible.",
    "tips": [
      "Familiarize yourself with Matlab and basic mathematical modeling.",
      "Work on presenting your research clearly and writing concise reports.",
      "Collaborate effectively in small research teams."
    ],
    "whatIsLookedFor": "Interest in computational biology, problem-solving skills, ability to work in a team, and willingness to learn and apply computational techniques to research.",
    "competitiveness": "Low",
    "deadline": "2026-04-14T23:59:00-07:00"
  },
  {
    "id": "gmu-assip",
    "title": "Aspiring Scientists Summer Internship Program (ASSIP)",
    "details": "ASSIP provides transformative research opportunities for high school and undergraduate students. Participants work one-on-one with faculty researchers at George Mason University and collaborating institutions, using state-of-the-art technology across disciplines such as astronomy, biochemistry, environmental science, computer science, neuroscience, robotics, climate science, and more. Interns gain hands-on research experience, scientific writing skills, and exposure to STEM careers.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Summer",
    "format": [
      "In-Person",
      "Hybrid"
    ],
    "paid": "Free",
    "link": "https://science.gmu.edu/assip",
    "email": "cosassip@gmu.edu",
    "eligibility": "High school students aged 15+ for remote/in-person computer labs, 16+ for wet-lab internships. Must not have graduated from university before or during the internship.",
    "tips": [
      "Prepare to articulate your research interests and prior experiences.",
      "Focus on developing both technical and scientific communication skills.",
      "Be proactive in seeking guidance from mentors and collaborating effectively in research teams."
    ],
    "whatIsLookedFor": "Curiosity, creativity, motivation, research aptitude, problem-solving skills, and commitment to completing rigorous projects.",
    "competitiveness": "Moderate",
    "deadline": "2025-02-28T23:59:00-05:00"
  },
  {
    "id": "rockefeller-ssrp",
    "title": "Summer Science Research Program (SSRP)",
    "details": "SSRP is a team-based mentored research program for high school juniors and seniors at Rockefeller University. Students work in research teams guided by scientific trainees from the Tri-Institutions (Rockefeller, MSK, WCMC) and gain hands-on experience in laboratory research, elective courses, workshops, guest lectures, and networking events.",
    "grades": [
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Summer",
    "format": [
      "In-Person"
    ],
    "paid": "Free",
    "link": "https://www.rockefeller.edu/outreach/ssrp/",
    "email": "hsresearch@rockefeller.edu",
    "eligibility": "High school juniors and seniors, aged 16+ at program start, must commit to the full seven-week program.",
    "tips": [
      "Prepare a clear statement of research interest and past experiences.",
      "Be ready to work full-time in a lab and collaborate effectively in teams.",
      "Develop skills in scientific writing and presenting research findings."
    ],
    "whatIsLookedFor": "Curiosity, motivation, research aptitude, teamwork, and commitment to a full-time mentored research experience.",
    "competitiveness": "Moderate",
    "deadline": "2026-01-02T23:59:00-05:00"
  },
  {
    "id": "wharton-mtsi",
    "title": "UPenn Management & Technology Summer Institute (M&TSI)",
    "details": "M&TSI is a rigorous, for-credit summer program for rising high school seniors to explore the integration of technology and management. Students take courses taught by Wharton and Penn Engineering faculty, participate in an intensive team prototyping project, develop a go-to-market plan, and receive feedback from entrepreneurs and investors. The program includes simulations, guest lectures, and awards a full college credit upon completion.",
    "grades": [
      "12"
    ],
    "category": "Business",
    "type": "Summer Program",
    "season": "Summer",
    "format": [
      "In-Person"
    ],
    "paid": "Almost free-Aid",
    "link": "https://fisher.wharton.upenn.edu/management-technology-summer-institute/",
    "email": "MTSI@summerdiscovery.com",
    "eligibility": "Rising high school seniors. International applicants and students seeking financial aid are encouraged to apply by the priority deadline.",
    "tips": [
      "Prepare a strong application highlighting academic achievements and leadership in extracurricular activities.",
      "Be ready for intensive, fast-paced coursework and team projects.",
      "Engage proactively with peers and faculty for mentorship and feedback."
    ],
    "whatIsLookedFor": "Academic excellence, leadership, motivation, creativity, teamwork, and commitment to a rigorous summer program.",
    "competitiveness": "Moderate",
    "deadline": "2026-04-02T23:59:00-04:00"
  },
  {
    "id": "jhu-cty-programs",
    "title": "Johns Hopkins Center for Talented Youth (CTY) Programs",
    "details": "CTY offers advanced academic programs for students in grades 2–12, providing rigorous courses, personalized instruction, and a community of peers. Programs include online courses, on-campus summer programs, and talent search assessments to identify and nurture gifted students. Students can accelerate learning, explore subjects in-depth, and gain enrichment beyond school curricula.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Academic Enrichment / Summer & Online Programs",
    "season": "Year-Round (Summer & Online Sessions)",
    "format": [
      "Online",
      "In-Person"
    ],
    "paid": "Paid",
    "link": "https://cty.jhu.edu/",
    "email": "ctyinfo@jhu.edu",
    "eligibility": "Students in grades 2–12 worldwide. Admission often requires above-grade-level testing through CTY Talent Search.",
    "tips": [
      "Select courses that challenge your current level and align with your interests.",
      "Engage actively with instructors and peers in online and on-campus programs.",
      "Plan ahead to balance program workload with school and extracurricular commitments."
    ],
    "whatIsLookedFor": "Intellectual curiosity, motivation, academic readiness, and a willingness to engage with challenging material.",
    "competitiveness": "Moderate",
    "deadline": "Varies annually"
  },
  {
    "id": "ram-foundation",
    "title": "Raising A Mathematician (RAM) Foundation Programs",
    "details": "RAM Foundation is a not-for-profit organization in India dedicated to identifying and nurturing mathematical talents. They offer residential and online camps, courses, and mentorship programs for students preparing for Mathematics and Informatics Olympiads. Programs include exposure to advanced mathematical concepts, problem-solving, competitions, and community building for students, parents, and educators.",
    "grades": [
      "8",
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Summer Program",
    "season": "School Year",
    "format": [
      "In-Person",
      "Online"
    ],
    "paid": "Almost free-Aid",
    "link": "https://www.raisingamathematician.com/",
    "email": "contact@raisingamathematician.com",
    "eligibility": "Students from grades 4 to 12 with interest and aptitude in mathematics and informatics. Selection-based for most programs.",
    "tips": [
      "Focus on developing strong problem-solving and logical reasoning skills.",
      "Engage with advanced math topics beyond school curriculum.",
      "Participate actively in mentorship and peer learning opportunities."
    ],
    "whatIsLookedFor": "Mathematical curiosity, problem-solving ability, motivation, creativity, and commitment to learning advanced mathematics.",
    "competitiveness": "Low",
    "deadline": "Varies annually"
  },
  {
    "id": "stonybrook-garcia-summer",
    "title": "Garcia Center Research Scholar Program for High School Students",
    "details": "The Garcia Center pre-college program allows high school students to engage in polymer science research alongside Garcia faculty and staff. Students work in focused research teams, contribute original findings, participate in national competitions, and are encouraged to publish in scientific journals and present at conferences. The program aims to convey the excitement of polymer research and provide long-term mentorship.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Summer",
    "format": [
      "In-Person"
    ],
    "paid": "Free",
    "link": "https://www.stonybrook.edu/commcms/garcia/summer_program/",
    "email": "garcia@stonybrook.edu",
    "eligibility": "High school students and teachers interested in polymer science research. Students work in teams with faculty mentorship.",
    "tips": [
      "Develop a strong interest in materials science and research.",
      "Be prepared to contribute original ideas and work collaboratively.",
      "Engage in scientific writing and presentations for competitions and conferences."
    ],
    "whatIsLookedFor": "Curiosity, teamwork, research aptitude, creativity, and motivation to contribute to scientific projects.",
    "competitiveness": "Low",
    "deadline": "Varies annually"
  },
  {
    "id": "iitm-pravartak-out-of-box",
    "title": "IITM Pravartak Out-of-Box Thinking Program",
    "details": "A program designed to foster creativity, innovation, and problem-solving skills among students. Participants engage in workshops, collaborative challenges, and design thinking exercises to develop practical solutions to real-world problems.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Summer Program",
    "season": "School Year",
    "format": [
      "In-Person"
    ],
    "paid": "Free",
    "link": "https://iitmpravartak.org.in/out-of-box-thinking",
    "email": "contact@iitmpravartak.org.in",
    "eligibility": "High school students with interest in science, technology, and creative problem-solving.",
    "tips": [
      "Practice creative problem-solving and brainstorming skills.",
      "Work on teamwork and presenting ideas clearly.",
      "Engage in exercises that challenge conventional thinking and explore innovative solutions."
    ],
    "whatIsLookedFor": "Creativity, analytical thinking, collaboration, motivation, and ability to think beyond standard solutions.",
    "competitiveness": "Moderate",
    "deadline": "Varies annually"
  },
  {
    "id": "berggruen-essay-competition",
    "title": "Berggruen Prize Essay Competition",
    "details": "The Berggruen Prize Essay Competition is an annual contest that encourages innovative thinking and cross-cultural perspectives. Participants submit essays addressing fundamental philosophical questions relevant to contemporary life and the future. Winning essays are awarded prizes and published, highlighting diverse global viewpoints.",
    "grades": [
      "11",
      "12"
    ],
    "category": [
      "Humanities",
      "Social Sciences"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://berggruen.org/eu/essay-competition-open",
    "email": "info@berggruen.org",
    "eligibility": "Open to individuals interested in philosophy, culture, and innovative ideas. Essays can be submitted in English or Chinese.",
    "tips": [
      "Focus on presenting a novel, clearly argued idea.",
      "Read and study classic and contemporary philosophical essays for inspiration.",
      "Emphasize clarity, creativity, and cross-cultural perspectives in your writing."
    ],
    "whatIsLookedFor": "Original thinking, intellectual rigor, clarity of expression, creativity, and the ability to present compelling philosophical arguments.",
    "competitiveness": "High",
    "deadline": "2026-02-28T23:59:00+00:00"
  },
  {
    "id": "international-research-olympiad",
    "title": "International Research Olympiad (IRO)",
    "details": "The International Research Olympiad (IRO) is a global platform for high school students to present and showcase original research across multiple disciplines. Participants submit their research projects and compete at an international level, gaining feedback from expert judges and opportunities for recognition. The Olympiad emphasizes innovation, problem-solving, and the ability to communicate complex ideas effectively through written work and presentations.",
    "grades": [
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "STEM",
      "Humanities",
      "Social Sciences"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "Online"
    ],
    "paid": "Paid",
    "link": "https://www.internationalresearcholympiad.org/",
    "email": "iro@samyakscience.com",
    "eligibility": "Open to high school students worldwide (Grades 9–12 or equivalent). Applicants must submit an original research project or paper in any discipline. Both individual and team submissions are accepted.",
    "tips": [
      "Choose a research topic that demonstrates originality and global relevance.",
      "The International Research Olympiad (IRO) has a registration fee of $25 USD.",
      "Ensure your submission is well-structured, with a clear research question, methodology, and conclusion.",
      "Showcase creativity and problem-solving in approaching your research.",
      "Practice communicating your ideas effectively for presentations and interviews.",
      "Pay close attention to formatting, citations, and academic rigor."
    ],
    "whatIsLookedFor": "The Olympiad values originality, depth of research, clarity in communication, and the ability to address real-world issues through innovative approaches. Judges look for both strong academic content and effective presentation skills.",
    "competitiveness": "High",
    "deadline": "2026-02-20T23:59:00-05:00"
  },
  {
    "id": "mathily-summer-program",
    "title": "MathILy Summer Program",
    "details": "MathILy is an intensive, five-week residential summer program for mathematically talented high school students. The program emphasizes creative problem-solving, exploration of advanced mathematics, and collaborative learning. Students engage in writing proofs, solving challenging problems, and developing their logical reasoning and critical thinking skills under the guidance of experienced mentors.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "Mathematics / STEM",
    "type": "Summer Program",
    "season": "Summer",
    "format": [
      "In-Person"
    ],
    "paid": "Paid",
    "link": "https://www.mathily.org/",
    "email": "info@mathily.org",
    "eligibility": "High school students with strong mathematical ability and interest in exploring advanced topics beyond the school curriculum.",
    "tips": [
      "Demonstrate creativity and problem-solving skills in your application.",
      "Engage actively in collaborative learning and mathematical discussions.",
      "Be prepared to tackle challenging problems and think independently."
    ],
    "whatIsLookedFor": "Mathematical talent, curiosity, creativity, collaborative spirit, and motivation for intensive study.",
    "competitiveness": "Moderate",
    "deadline": "2026-03-15T23:59:00-05:00"
  },
  {
    "id": "euler-circle",
    "title": "Euler Circle",
    "details": "Euler Circle is a mathematics institute offering advanced college-level mathematics classes for high school students who have exhausted their school curriculum. The program emphasizes problem-solving, proof-writing, and independent research, with opportunities to explore unsolved problems and write expository papers. Classes cover topics such as mathematical thinking, transition to proofs, fundamentals of higher mathematics, and infinite series.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "School Year",
    "format": [
      "Online"
    ],
    "paid": "Paid",
    "link": "https://eulercircle.com/",
    "email": "info@eulercircle.com",
    "eligibility": "High school students with strong mathematical ability and interest in advanced mathematics topics beyond the standard curriculum.",
    "tips": [
      "Demonstrate readiness for college-level mathematics in your application.",
      "Be prepared to solve challenging problem sets and engage in proof-writing.",
      "Show motivation for independent research and willingness to tackle unsolved problems."
    ],
    "whatIsLookedFor": "Mathematical talent, problem-solving skills, initiative, curiosity, and commitment to rigorous study.",
    "competitiveness": "Low",
    "deadline": "2026-11-23T23:59:00-08:00"
  },
  {
    "id": "epsilon-india",
    "title": "Epsilon India Gifted Math Camp",
    "details": "Epsilon India is an intensive summer camp for mathematically gifted students aged 9–13. The program provides a challenging curriculum exposing students to substantial mathematical ideas, fostering critical thinking, problem-solving, and mathematical maturity. The camp includes interaction with professional mathematicians, collaborative problem-solving, and a parent program to support nurturing mathematically gifted children.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Summer Program",
    "season": "School Year",
    "format": [
      "In-Person"
    ],
    "paid": "Free",
    "link": "https://www.epsilonindia.org/",
    "email": "epsiloncampindia@gmail.com",
    "eligibility": "Students aged 9–13 with demonstrated mathematical ability, maturity, and passion for learning mathematics. Selection involves pre-test, teacher recommendations, and parent questionnaire.",
    "tips": [
      "Demonstrate passion and interest in mathematics beyond the school curriculum.",
      "Engage with challenging mathematical problems and show curiosity.",
      "Highlight previous achievements or experiences in mathematics in the application."
    ],
    "whatIsLookedFor": "Mathematical maturity, creativity, problem-solving skills, curiosity, and enthusiasm for deep learning.",
    "competitiveness": "Moderate",
    "deadline": "2026-03-31T23:59:00+05:30"
  },
  {
    "id": "bpho-computational-challenge",
    "title": "BPHO Computational Challenge",
    "details": "The BPHO Computational Challenge is a national-level competition in the UK designed to test students’ problem-solving and programming skills within the context of physics. Participants solve computational physics problems using programming and mathematical modeling, developing both theoretical understanding and practical coding ability.",
    "grades": [
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Competition",
    "season": "School Year",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://www.bpho.org.uk/bpho/computational-challenge/",
    "email": "bpho@iop.org",
    "eligibility": "High school students in the UK or affiliated schools, typically aged 14–18.",
    "tips": [
      "Practice computational problem-solving and physics simulations.",
      "Develop skills in programming languages like Python or MATLAB.",
      "Focus on clear documentation and explanation of code and results."
    ],
    "whatIsLookedFor": "Analytical thinking, problem-solving skills, physics understanding, coding ability, and clarity in presentation of results.",
    "competitiveness": "High",
    "deadline": "Varies annually"
  },
  {
    "id": "pravaha-episteme-2025",
    "title": "Episteme 2025",
    "details": "Episteme 2025, an initiative by Pravaha in collaboration with IIIT-Hyderabad, is designed to spark curiosity and deepen knowledge across sustainability, climate change, advanced STEM, and innovation. The program combines interactive lectures, hands-on workshops, design challenges, field excursions, and entrepreneurship activities to create a rich, experiential learning environment for young students.",
    "grades": [
      "6",
      "7",
      "8",
      "9"
    ],
    "category": "STEM",
    "type": "Summer Program",
    "season": "Annual",
    "format": [
      "In-Person"
    ],
    "paid": "Paid",
    "link": "https://www.pravaha.in/episteme-2025/",
    "email": "info@pravaha.in",
    "eligibility": "Students aged 11–14 (grades 6–9), demonstrating curiosity, creativity, and interest in STEM, sustainability, and innovation.",
    "tips": [
      "Highlight interest in STEM, sustainability, and entrepreneurship in your application.",
      "Demonstrate curiosity, creativity, and teamwork abilities.",
      "Be prepared to engage in hands-on projects, field visits, and collaborative challenges."
    ],
    "whatIsLookedFor": "Curiosity, creativity, critical thinking, teamwork, problem-solving, and enthusiasm for interdisciplinary learning.",
    "competitiveness": "Moderate",
    "deadline": "2025-03-16T23:59:00+05:30"
  },
  {
    "id": "iris-national-science-fair",
    "title": "IRIS National Science Fair (IRIS)",
    "details": "The Initiative for Research and Innovation in STEM (IRIS) is India's most prestigious national-level science fair for school students. It provides a platform for young innovators to present original STEM research and innovations. IRIS is the official pathway for Indian students to qualify for the Regeneron International Science and Engineering Fair (ISEF), the world's largest pre-college research competition.",
    "grades": [
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "STEM"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "Hybrid"
    ],
    "paid": "Free",
    "link": "https://irisnationalfair.org/",
    "email": "contact@irisnationalfair.org",
    "eligibility": "Open to Indian students in Grades 5–12. Projects must demonstrate originality, scientific thought, and potential impact. Both individual and team projects are allowed.",
    "tips": [
      "Submit a clear and original abstract with strong scientific reasoning.",
      "Choose a problem with societal or environmental relevance.",
      "Use a proper research methodology and highlight innovation.",
      "Prepare for both written and oral presentations.",
      "Communicate your project in simple yet impactful language."
    ],
    "whatIsLookedFor": "Judges value originality, scientific depth, problem-solving ability, and innovation. Strong emphasis is placed on real-world applications, clarity of communication, and the potential societal impact of the research.",
    "competitiveness": "High",
    "deadline": "2025-10-31T23:59:00+05:30"
  },
  {
    "id": "igem-competition",
    "title": "International Genetically Engineered Machine (iGEM) Competition",
    "details": "The International Genetically Engineered Machine (iGEM) Competition is the world’s largest synthetic biology competition, where high school and university teams design, build, and test innovative biological systems. Participants work collaboratively on real-world challenges in health, environment, energy, and more, using genetic engineering and synthetic biology. The competition culminates in the annual iGEM Grand Jamboree, where teams present their projects to an international community of scientists, entrepreneurs, and innovators.",
    "grades": [
      "9",
      "10",
      "11",
      "12",
      "UG"
    ],
    "category": [
      "STEM"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "Hybrid"
    ],
    "paid": "Paid",
    "link": "https://competition.igem.org/",
    "email": "hq@igem.org",
    "eligibility": "Open to high school and undergraduate students worldwide. Teams must register through their schools or organizations and work on a synthetic biology project over several months. Both new and experienced teams are welcome.",
    "tips": [
      "Assemble a diverse team with skills in biology, engineering, computer science, and design.",
      "School will register on your behlaf and make teams for the students.",
      "Choose a project that addresses a real-world problem with innovative synthetic biology solutions.",
      "Document your project thoroughly on your iGEM wiki for evaluation.",
      "Engage with the community through outreach and collaboration with other teams.",
      "Prepare for clear and impactful presentations at the iGEM Grand Jamboree."
    ],
    "whatIsLookedFor": "iGEM values creativity, interdisciplinary teamwork, scientific rigor, and real-world impact. Judges look for innovation, strong experimental design, thorough documentation, and community engagement.",
    "competitiveness": "High",
    "deadline": "2026-05-31T23:59:00-04:00"
  },
  {
    "id": "horizon-essay-prize",
    "title": "Horizon Academic Essay Prize",
    "details": "The Horizon Academic Essay Prize is a global competition that recognizes exceptional academic writing by high school students. Participants submit essays that demonstrate critical thinking, originality, and academic rigor across a range of disciplines. The competition is designed to encourage intellectual curiosity, research-based argumentation, and clarity of communication in young scholars.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "STEM",
      "Humanities",
      "Social Sciences"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "Online Submission"
    ],
    "paid": "Free",
    "link": "https://horizoninspires.com/essay-prize/",
    "email": "https://airtable.com/appVSLDvRVIOB8e97/shrxZzcpueejHwlCl",
    "eligibility": "Open to high school students worldwide (Grades 9–12 or equivalent). Students may submit essays individually on a wide range of academic topics. Originality and clarity of argument are key criteria.",
    "tips": [
      "Choose a research question or argument that reflects both originality and depth.",
      "Ensure your essay has a strong thesis statement and logical structure.",
      "Use credible academic sources and proper citations.",
      "Demonstrate critical thinking and clear reasoning throughout your essay.",
      "Revise multiple times for clarity, style, and grammar before submission."
    ],
    "whatIsLookedFor": "Judges value originality of thought, depth of research, strong academic writing, and the ability to construct a clear, compelling argument. Clarity, precision, and adherence to academic standards are critical.",
    "competitiveness": "Moderate",
    "deadline": "2026-07-10T23:59:00-04:00"
  },
  {
    "id": "iypt",
    "title": "International Young Physicists’ Tournament (IYPT)",
    "details": "The International Young Physicists’ Tournament (IYPT), often called the 'Physics World Cup,' is a prestigious global competition where high school students work in teams to solve open-ended physics problems. Teams prepare research-based solutions over several months and present them in a debate-style format known as 'Physics Fights,' where they defend, oppose, and review solutions in front of an international jury. The tournament emphasizes collaboration, scientific creativity, critical thinking, and communication skills.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "STEM"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "In-person"
    ],
    "paid": "Paid",
    "link": "https://www.iypt.org/",
    "email": "office@iypt.org",
    "eligibility": "Open to high school students worldwide (Grades 9–12 or equivalent). Students compete in teams (usually 5 members) selected through national or regional tournaments. Teams must prepare solutions to 17 published physics problems prior to the international event.",
    "tips": [
      "Start early by carefully analyzing the 17 IYPT problems released each year.",
      "Combine theory, experiment, and creativity to propose well-rounded solutions.",
      "Practice debate-style presentations to effectively defend and critique physics solutions.",
      "Work collaboratively within your team to divide tasks and refine research quality.",
      "Engage in mock 'Physics Fights' to prepare for the tournament format."
    ],
    "whatIsLookedFor": "IYPT values scientific rigor, originality, teamwork, and communication. Judges look for depth of research, experimental evidence, and the ability to present and defend solutions clearly in a debate setting.",
    "competitiveness": "High",
    "deadline": "2026-08-31T23:59:00+05:30"
  },
  {
    "id": "harvard-openbio-sri",
    "title": "Harvard Student Research Institute (SRI)",
    "details": "The Student Research Institute (SRI) is a virtual summer research program by the Harvard Undergraduate OpenBio Laboratory that aims to democratize access to scientific research for high school students around the world. Participants are paired with PhD mentors to conduct original projects or literature reviews, attend weekly workshops, present their work, and may have their results published in an undergraduate journal. The program is free of cost to admitted students.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Summer",
    "format": [
      "Virtual"
    ],
    "paid": "Free",
    "link": "https://soco.college.harvard.edu/00003/openbio-home/",
    "email": "sri@harvardopenbio.org",
    "eligibility": "Open to high school students (grades 9–12) globally. No prior research experience required. Students must be committed to research and scientific inquiry.",
    "tips": [
      "Emphasize your curiosity in biology or related fields and show how you've independently explored scientific topics.",
      "Use examples of self-motivated learning, participation in science clubs or projects, and clear scientific questions you might like to explore.",
      "Write strong, thoughtful essays showing your motivations, not just your achievements."
    ],
    "whatIsLookedFor": "SRI looks for students with intellectual curiosity, perseverance, self-motivation, and an interest in contributing to scientific research. Strong communication, openness to mentorship, and consistency in work are valued. While past research experience is helpful, it is not required.",
    "competitiveness": "High",
    "deadline": "2025-04-30T23:59:00-04:00"
  },
  {
    "id": "columbia-medicine-research-summer",
    "title": "The Columbia Medicine and Research Summer Program",
    "details": "The Medicine and Research Summer Program is hosted by Columbia University Vagelos College of Physicians and Surgeons (VP&S) Global Health Organization in collaboration with the International Young Researchers’ Conference (IYRC). It provides high school students with the opportunity to explore medical research, gain exposure to global health issues, and develop foundational laboratory and clinical research skills. The program combines lectures by Columbia faculty, hands-on workshops, and mentorship from researchers and medical professionals.",
    "grades": [
      "11"
    ],
    "category": "STEM",
    "type": "Research Program",
    "season": "Summer",
    "format": [
      "On-site"
    ],
    "paid": "Almost free-Aid",
    "link": "https://www.the-iyrc.org/summerprogram.html",
    "email": "info@the-iyrc.org",
    "eligibility": "Open to motivated high school students entering grade 11 with a strong interest in medicine, biology, or related sciences.",
    "tips": [
      "Highlight previous biology or chemistry experience in your application.",
      "Show genuine curiosity about medicine and research.",
      "Be clear about your motivation to learn from Columbia faculty."
    ],
    "whatIsLookedFor": "Students with strong academic performance, initiative, and genuine interest in pursuing medical or research careers.",
    "competitiveness": "High",
    "deadline": "2025-11-01T23:59:00-05:00"
  },
  {
    "id": "wro",
    "title": "World Robot Olympiad (WRO)",
    "details": "The World Robot Olympiad (WRO) is a global robotics competition that challenges students to design, build, and program robots to solve real-world problems. Each year, WRO announces new themes and challenges, encouraging innovation, teamwork, and creative problem-solving. Students compete in categories such as RoboMission, RoboSports, Future Innovators, and Future Engineers, applying STEM knowledge, coding, and engineering design in an exciting international setting.",
    "grades": [
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "STEM"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "In-person"
    ],
    "paid": "Paid",
    "link": "https://wroindia.org/",
    "email": "sarvjeet@indiastemfoundation.org",
    "eligibility": "Open to students worldwide aged 8–19, divided into Elementary, Junior, Senior, and University categories. Teams typically consist of 2–3 students and a coach. Participants must first qualify through regional and national competitions to reach the WRO International Finals.",
    "tips": [
      "Study the annual WRO challenge rules carefully and design your robot accordingly.",
      "Develop strong coding and engineering skills to handle both expected and unexpected challenges.",
      "Collaborate effectively within your team to divide tasks (design, coding, testing).",
      "Participate in local robotics clubs or workshops to gain practice ahead of competitions.",
      "Focus on innovation and creativity in both design and problem-solving approaches."
    ],
    "whatIsLookedFor": "WRO values innovation, teamwork, problem-solving, and practical application of STEM concepts. Judges look for well-engineered robots, creative solutions, and effective teamwork in handling competition challenges.",
    "competitiveness": "High",
    "deadline": "2026-08-01T23:59:00+05:30"
  },
  {
    "id": "world-scholars-cup",
    "title": "World Scholar’s Cup (WSC)",
    "details": "The World Scholar’s Cup (WSC) is an international team academic competition that brings together students from around the world to engage in collaborative learning and debate. Covering six subjects under an annual theme, participants take part in four events: Team Debate, Scholar’s Challenge (quiz), Collaborative Writing, and the Scholar’s Bowl. WSC emphasizes curiosity, interdisciplinary thinking, teamwork, and fun while creating a global community of scholars.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "STEM"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "In-person"
    ],
    "paid": "Paid",
    "link": "https://www.scholarscup.org/",
    "email": "info@scholarscup.org",
    "eligibility": "Open to students aged 10–18 worldwide. Teams of three students compete in multiple subject areas and events. No prior experience in debate or writing is required; the competition encourages both beginners and experienced students.",
    "tips": [
      "Form a balanced team with diverse strengths in debate, writing, and knowledge quizzes.",
      "Study the annual theme and six subjects thoroughly using the official WSC curriculum.",
      "Practice debating in a team setting to build confidence and collaborative strategy.",
      "Work on writing essays under time pressure to prepare for the Collaborative Writing event.",
      "Enjoy the community aspect—WSC values enthusiasm, curiosity, and global friendships."
    ],
    "whatIsLookedFor": "WSC values teamwork, critical thinking, curiosity, and creativity. Judges and facilitators look for students who can engage deeply with ideas, express themselves clearly, and collaborate effectively in diverse formats.",
    "competitiveness": "Moderate",
    "deadline": "Varies annually"
  },
  {
    "id": "diamond-challenge",
    "title": "Diamond Challenge for High School Entrepreneurs",
    "details": "The Diamond Challenge is a global entrepreneurship competition for high school students, designed to inspire innovation, creativity, and leadership. Participants work individually or in teams to develop business ideas, create prototypes, and pitch their concepts to a panel of expert judges. The program provides mentorship, workshops, and feedback to help students transform ideas into actionable solutions, fostering entrepreneurial thinking and problem-solving skills.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "STEM"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://diamondchallenge.org/",
    "email": "info@diamondchallenge.org",
    "eligibility": "Open to students worldwide currently in high school (Grades 9–12 or equivalent) aged 14-18. Participants can compete individually or in teams. Students should have a passion for entrepreneurship, problem-solving, and innovation.",
    "tips": [
      "Focus on originality and feasibility of your business idea or social venture.",
      "Clearly articulate the problem, solution, market, and impact in your submission.",
      "Demonstrate creativity, research, and critical thinking in your pitch and materials.",
      "Seek mentorship and feedback early to refine your project before submission.",
      "Highlight teamwork, leadership, and your role in developing the project."
    ],
    "whatIsLookedFor": "The Diamond Challenge values creativity, innovation, entrepreneurial mindset, feasibility, and impact. Judges look for students who demonstrate initiative, problem-solving, and the ability to translate ideas into actionable solutions.",
    "competitiveness": "High",
    "deadline": "2026-01-15T17:00:00-05:00"
  },
  {
    "id": "conrad-challenge",
    "title": "Conrad Challenge",
    "details": "The Conrad Challenge is a global, multi-phase innovation and entrepreneurship competition for high school students. Participants develop solutions to real-world problems in STEM, entrepreneurship, and social impact, working individually or in teams. The program emphasizes creativity, collaboration, and critical thinking, with mentorship from experts and opportunities to present solutions to judges, industry leaders, and NASA and Conrad Foundation advisors.",
    "grades": [
      "9",
      "10",
      "11",
      "12",
      "Gap Year"
    ],
    "category": [
      "STEM"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://conrad.spacecenter.org/",
    "email": "info@conradchallenge.org",
    "eligibility": "Open to high school students worldwide (Grades 9–12 or equivalent) aged 13-18. Participants can compete individually or in teams. Students should have a strong interest in innovation, problem-solving, and entrepreneurship.",
    "tips": [
      "Focus on originality, feasibility, and impact of your project.",
      "Demonstrate a clear understanding of the problem and a creative solution approach.",
      "Highlight teamwork, leadership, and your role in developing the project.",
      "Leverage mentorship and resources provided by the Conrad Challenge to refine your idea.",
      "Prepare a strong presentation or pitch with clear communication of your solution and its real-world applications."
    ],
    "whatIsLookedFor": "The Conrad Challenge seeks students who are innovative, collaborative, and solutions-oriented. Judges value creativity, critical thinking, problem-solving skills, and the potential impact of the proposed solution.",
    "competitiveness": "High",
    "deadline": "2025-10-30T23:59:00-05:00"
  },
  {
    "id": "isef",
    "title": "International Science and Engineering Fair (ISEF)",
    "details": "ISEF is the world’s largest international pre-college science competition, bringing together high school students from around the globe to showcase original research projects in all STEM fields. Participants present their work to expert judges, compete for scholarships, awards, and recognition, and engage with a community of like-minded young scientists. The program emphasizes scientific rigor, creativity, and innovation, providing students with mentorship, networking, and opportunities to attend lectures by world-renowned scientists.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "STEM"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "In-person- Phoenix, Arizona"
    ],
    "paid": "Free",
    "link": "https://www.societyforscience.org/isef/",
    "email": "info@societyforscience.org",
    "eligibility": "Open to high school students worldwide (Grades 9–12 or equivalent) who have completed original research projects in STEM fields. Students must qualify through affiliated local, regional, or national fairs to participate in ISEF.",
    "tips": [
      "Ensure your research project is original, well-documented, and follows scientific methodology.",
      "Focus on clarity in your research presentation and report.",
      "Demonstrate creativity, analytical skills, and depth of understanding in your field.",
      "Obtain strong recommendation letters from mentors or teachers familiar with your research.",
      "Prepare to discuss your project in detail with judges and answer questions confidently."
    ],
    "whatIsLookedFor": "ISEF values originality, scientific rigor, problem-solving ability, creativity, and effective communication. Judges seek students capable of conducting independent research and presenting it clearly to an expert audience.",
    "competitiveness": "High",
    "deadline": "Varies annually"
  },
  {
    "id": "breakthrough-junior-challenge",
    "title": "Breakthrough Junior Challenge",
    "details": "The Breakthrough Junior Challenge is an annual global competition for students to create a short video (3 minutes or less) that explains a concept in physics, mathematics, or life sciences in a creative and engaging way. Participants showcase their understanding, communication skills, and creativity, with the opportunity to win scholarships, technology prizes, and the chance to have their work featured worldwide.",
    "grades": [
      "9",
      "10",
      "11",
      "12",
      "Gap Year"
    ],
    "category": [
      "STEM"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "Online"
    ],
    "paid": "Free",
    "link": "https://breakthroughjuniorchallenge.org/",
    "email": "info@breakthroughprize.org",
    "eligibility": "Open to high school students worldwide (Grades 9–12 or equivalent). Students may submit individually or in teams, and submissions must be original and created by the student(s).",
    "tips": [
      "Clearly explain the scientific or mathematical concept in a simple and engaging way.",
      "Use creative storytelling, visuals, and examples to make your video memorable.",
      "Ensure your submission is accurate, scientifically rigorous, and original.",
      "Keep the video concise and within the 3-minute limit.",
      "Highlight your passion for STEM and your ability to communicate complex ideas effectively."
    ],
    "whatIsLookedFor": "The competition values clarity of explanation, creativity, originality, and the ability to engage an audience. Judges look for students who can make complex scientific ideas accessible, visually compelling, and memorable.",
    "competitiveness": "High",
    "deadline": "2026-09-15T23:59:00-07:00"
  },
  {
    "id": "inespo-olympiade",
    "title": "INESPO Olympiade",
    "details": "The INESPO Olympiade is an international online competition for high school students that challenges participants in subjects including mathematics, science, and computer science. The competition emphasizes problem-solving, analytical thinking, and the application of knowledge in creative and rigorous ways. Students compete individually or in teams and gain exposure to international academic standards and collaborative problem-solving environments.",
    "grades": [
      "9",
      "10",
      "11",
      "12"
    ],
    "category": [
      "STEM"
    ],
    "type": "Competition",
    "season": "School Year",
    "format": [
      "Online"
    ],
    "paid": "Paid",
    "link": "https://www.inespo.org/olympiade/",
    "email": "contact@inespo.org",
    "eligibility": "Open to high school students worldwide (Grades 9–12 or equivalent). Participants may compete individually or in teams, and must demonstrate strong interest and aptitude in STEM subjects.",
    "tips": [
      "Prepare thoroughly in mathematics, science, and related subjects relevant to the competition rounds.",
      "Practice problem-solving and analytical reasoning skills under timed conditions.",
      "Collaborate effectively if participating as part of a team and divide tasks strategically.",
      "Review past competition questions if available to understand the format and level of difficulty.",
      "Ensure clear, accurate, and logical presentation of solutions in written submissions or online assessments."
    ],
    "whatIsLookedFor": "Students with strong analytical and problem-solving skills, creativity in approaching STEM challenges, and the ability to work independently or in a team. Judges value precision, logical reasoning, and innovative thinking in solutions.",
    "competitiveness": "Moderate",
    "deadline": "Varies annually"
  }
]